graph(%self.1 : __torch__.TraceWrapper,
      %tensor_list : Float(1:1800000, 3:600000, 750:800, 800:1, requires_grad=0, device=cpu)):
  %2 : __torch__.models.detr.DETR = prim::GetAttr[name="model"](%self.1)
  %7 : __torch__.models.detr.MLP = prim::GetAttr[name="bbox_embed"](%2)
  %8 : __torch__.torch.nn.modules.linear.___torch_mangle_139.Linear = prim::GetAttr[name="class_embed"](%2)
  %9 : __torch__.torch.nn.modules.sparse.Embedding = prim::GetAttr[name="query_embed"](%2)
  %10 : Tensor = prim::GetAttr[name="weight"](%9)
  %11 : __torch__.models.transformer.Transformer = prim::GetAttr[name="transformer"](%2)
  %12 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="input_proj"](%2)
  %13 : __torch__.models.backbone.Joiner = prim::GetAttr[name="backbone"](%2)
  %14 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %15 : Tensor[] = aten::unbind(%tensor_list, %14), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %img.1 : Float(3:600000, 750:800, 800:1, requires_grad=0, device=cpu) = prim::ListUnpack(%15), scope: __module.model
  %17 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %18 : int = aten::size(%img.1, %17), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %19 : Long(device=cpu) = prim::NumToTensor(%18), scope: __module.model
  %20 : Tensor[] = prim::ListConstruct(%19), scope: __module.model
  %21 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %22 : Long(1:1, requires_grad=0, device=cpu) = aten::stack(%20, %21), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %23 : int = prim::Constant[value=6](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %24 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %25 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %26 : None = prim::Constant(), scope: __module.model
  %27 : Float(1:1, requires_grad=0, device=cpu) = aten::to(%22, %23, %24, %25, %26), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %28 : Float(requires_grad=0, device=cpu) = aten::max(%27), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %29 : int = prim::Constant[value=4](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %30 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %31 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %32 : None = prim::Constant(), scope: __module.model
  %s1.1 : Long(requires_grad=0, device=cpu) = aten::to(%28, %29, %30, %31, %32), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %34 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %35 : Tensor[] = aten::unbind(%tensor_list, %34), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %img.2 : Float(3:600000, 750:800, 800:1, requires_grad=0, device=cpu) = prim::ListUnpack(%35), scope: __module.model
  %37 : int = prim::Constant[value=1](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %38 : int = aten::size(%img.2, %37), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %39 : Long(device=cpu) = prim::NumToTensor(%38), scope: __module.model
  %40 : Tensor[] = prim::ListConstruct(%39), scope: __module.model
  %41 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %42 : Long(1:1, requires_grad=0, device=cpu) = aten::stack(%40, %41), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %43 : int = prim::Constant[value=6](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %44 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %45 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %46 : None = prim::Constant(), scope: __module.model
  %47 : Float(1:1, requires_grad=0, device=cpu) = aten::to(%42, %43, %44, %45, %46), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %48 : Float(requires_grad=0, device=cpu) = aten::max(%47), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %49 : int = prim::Constant[value=4](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %50 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %51 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %52 : None = prim::Constant(), scope: __module.model
  %s1.2 : Long(requires_grad=0, device=cpu) = aten::to(%48, %49, %50, %51, %52), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %54 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %55 : Tensor[] = aten::unbind(%tensor_list, %54), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %img.3 : Float(3:600000, 750:800, 800:1, requires_grad=0, device=cpu) = prim::ListUnpack(%55), scope: __module.model
  %57 : int = prim::Constant[value=2](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %58 : int = aten::size(%img.3, %57), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %59 : Long(device=cpu) = prim::NumToTensor(%58), scope: __module.model
  %60 : Tensor[] = prim::ListConstruct(%59), scope: __module.model
  %61 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %62 : Long(1:1, requires_grad=0, device=cpu) = aten::stack(%60, %61), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %63 : int = prim::Constant[value=6](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %64 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %65 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %66 : None = prim::Constant(), scope: __module.model
  %67 : Float(1:1, requires_grad=0, device=cpu) = aten::to(%62, %63, %64, %65, %66), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %68 : Float(requires_grad=0, device=cpu) = aten::max(%67), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %69 : int = prim::Constant[value=4](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %70 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %71 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %72 : None = prim::Constant(), scope: __module.model
  %s1 : Long(requires_grad=0, device=cpu) = aten::to(%68, %69, %70, %71, %72), scope: __module.model # ../../ml/detr/util/misc.py:337:0
  %74 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %75 : Tensor[] = aten::unbind(%tensor_list, %74), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/tensor.py:594:0
  %img : Float(3:600000, 750:800, 800:1, requires_grad=0, device=cpu) = prim::ListUnpack(%75), scope: __module.model
  %77 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %78 : int = aten::size(%img, %77), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %s2.1 : Long(device=cpu) = prim::NumToTensor(%78), scope: __module.model
  %80 : int = prim::Constant[value=1](), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %81 : int = aten::size(%img, %80), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %s2.2 : Long(device=cpu) = prim::NumToTensor(%81), scope: __module.model
  %83 : int = prim::Constant[value=2](), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %84 : int = aten::size(%img, %83), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %s2 : Long(device=cpu) = prim::NumToTensor(%84), scope: __module.model
  %86 : int = prim::Constant[value=1](), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %87 : Long(requires_grad=0, device=cpu) = aten::sub(%s1.1, %s2.1, %86), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %88 : int = aten::Int(%87), scope: __module.model
  %89 : int = prim::Constant[value=1](), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %90 : Long(requires_grad=0, device=cpu) = aten::sub(%s1.2, %s2.2, %89), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %91 : int = aten::Int(%90), scope: __module.model
  %92 : int = aten::Int(%90), scope: __module.model
  %93 : int = prim::Constant[value=1](), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %94 : Long(requires_grad=0, device=cpu) = aten::sub(%s1, %s2, %93), scope: __module.model # ../../ml/detr/util/misc.py:348:0
  %95 : int = aten::Int(%94), scope: __module.model
  %96 : int = aten::Int(%94), scope: __module.model
  %97 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %98 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %99 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %100 : int[] = prim::ListConstruct(%97, %96, %98, %92, %99, %88), scope: __module.model
  %101 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %padded_img : Float(3:600000, 750:800, 800:1, requires_grad=0, device=cpu) = aten::constant_pad_nd(%img, %100, %101), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %103 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %104 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %105 : Float(750:800, 800:1, requires_grad=0, device=cpu) = aten::select(%img, %103, %104), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %106 : int = prim::Constant[value=3](), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %107 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %108 : Device = prim::Constant[value="cpu"](), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %109 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %110 : None = prim::Constant(), scope: __module.model
  %input.1 : Int(750:800, 800:1, requires_grad=0, device=cpu) = aten::zeros_like(%105, %106, %107, %108, %109, %110), scope: __module.model # ../../ml/detr/util/misc.py:352:0
  %112 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %113 : int = prim::Constant[value=0](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %114 : int[] = prim::ListConstruct(%112, %95, %113, %91), scope: __module.model
  %115 : int = prim::Constant[value=1](), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %padded_mask : Int(750:800, 800:1, requires_grad=0, device=cpu) = aten::constant_pad_nd(%input.1, %114, %115), scope: __module.model # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:3553:0
  %117 : int = prim::Constant[value=11](), scope: __module.model # ../../ml/detr/util/misc.py:354:0
  %118 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:354:0
  %119 : bool = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:354:0
  %120 : None = prim::Constant(), scope: __module.model
  %121 : Bool(750:800, 800:1, requires_grad=0, device=cpu) = aten::to(%padded_mask, %117, %118, %119, %120), scope: __module.model # ../../ml/detr/util/misc.py:354:0
  %122 : Tensor[] = prim::ListConstruct(%padded_img), scope: __module.model
  %123 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:356:0
  %input.2 : Float(1:1800000, 3:600000, 750:800, 800:1, requires_grad=0, device=cpu) = aten::stack(%122, %123), scope: __module.model # ../../ml/detr/util/misc.py:356:0
  %125 : Tensor[] = prim::ListConstruct(%121), scope: __module.model
  %126 : int = prim::Constant[value=0](), scope: __module.model # ../../ml/detr/util/misc.py:357:0
  %m : Bool(1:600000, 750:800, 800:1, requires_grad=0, device=cpu) = aten::stack(%125, %126), scope: __module.model # ../../ml/detr/util/misc.py:357:0
  %128 : __torch__.models.position_encoding.PositionEmbeddingSine = prim::GetAttr[name="1"](%13)
  %129 : __torch__.models.backbone.Backbone = prim::GetAttr[name="0"](%13)
  %130 : __torch__.torchvision.models._utils.IntermediateLayerGetter = prim::GetAttr[name="body"](%129)
  %131 : __torch__.torch.nn.modules.container.___torch_mangle_286.Sequential = prim::GetAttr[name="layer4"](%130)
  %132 : __torch__.torch.nn.modules.container.___torch_mangle_258.Sequential = prim::GetAttr[name="layer3"](%130)
  %133 : __torch__.torch.nn.modules.container.___torch_mangle_206.Sequential = prim::GetAttr[name="layer2"](%130)
  %134 : __torch__.torch.nn.modules.container.___torch_mangle_170.Sequential = prim::GetAttr[name="layer1"](%130)
  %135 : __torch__.torch.nn.modules.pooling.MaxPool2d = prim::GetAttr[name="maxpool"](%130)
  %136 : __torch__.torch.nn.modules.activation.ReLU = prim::GetAttr[name="relu"](%130)
  %137 : __torch__.models.backbone.FrozenBatchNorm2d = prim::GetAttr[name="bn1"](%130)
  %138 : __torch__.torch.nn.modules.conv.___torch_mangle_144.Conv2d = prim::GetAttr[name="conv1"](%130)
  %139 : Tensor = prim::GetAttr[name="weight"](%138)
  %140 : None = prim::Constant(), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1
  %141 : int = prim::Constant[value=2](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %142 : int = prim::Constant[value=2](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %143 : int[] = prim::ListConstruct(%141, %142), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1
  %144 : int = prim::Constant[value=3](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %145 : int = prim::Constant[value=3](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %146 : int[] = prim::ListConstruct(%144, %145), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1
  %147 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %148 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %149 : int[] = prim::ListConstruct(%147, %148), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1
  %150 : bool = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %151 : int = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %152 : int = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %153 : int[] = prim::ListConstruct(%151, %152), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1
  %154 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %155 : bool = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %156 : bool = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %157 : bool = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %158 : bool = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %x.1 : Float(1:9600000, 64:150000, 375:400, 400:1, requires_grad=0, device=cpu) = aten::_convolution(%input.2, %139, %140, %143, %146, %149, %150, %153, %154, %155, %156, %157, %158), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %160 : Tensor = prim::GetAttr[name="running_mean"](%137)
  %161 : Tensor = prim::GetAttr[name="running_var"](%137)
  %162 : Tensor = prim::GetAttr[name="bias"](%137)
  %163 : Tensor = prim::GetAttr[name="weight"](%137)
  %164 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:48:0
  %165 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:48:0
  %166 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:48:0
  %167 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:48:0
  %168 : int[] = prim::ListConstruct(%164, %165, %166, %167), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1
  %w.1 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%163, %168), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:48:0
  %170 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:49:0
  %171 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:49:0
  %172 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:49:0
  %173 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:49:0
  %174 : int[] = prim::ListConstruct(%170, %171, %172, %173), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1
  %b.1 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%162, %174), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:49:0
  %176 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:50:0
  %177 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:50:0
  %178 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:50:0
  %179 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:50:0
  %180 : int[] = prim::ListConstruct(%176, %177, %178, %179), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1
  %rv.1 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%161, %180), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:50:0
  %182 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:51:0
  %183 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:51:0
  %184 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:51:0
  %185 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:51:0
  %186 : int[] = prim::ListConstruct(%182, %183, %184, %185), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1
  %rm.1 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%160, %186), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:51:0
  %188 : Double(requires_grad=0, device=cpu) = prim::Constant[value={1e-05}](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:53:0
  %189 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:53:0
  %190 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::add(%rv.1, %188, %189), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:53:0
  %191 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::rsqrt(%190), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:53:0
  %scale.1 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::mul(%w.1, %191), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:53:0
  %193 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::mul(%rm.1, %scale.1), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:54:0
  %194 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:54:0
  %bias.1 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::sub(%b.1, %193, %194), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:54:0
  %196 : Float(1:9600000, 64:150000, 375:400, 400:1, requires_grad=0, device=cpu) = aten::mul(%x.1, %scale.1), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:55:0
  %197 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:55:0
  %input.3 : Float(1:9600000, 64:150000, 375:400, 400:1, requires_grad=0, device=cpu) = aten::add(%196, %bias.1, %197), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.bn1 # ../../ml/detr/models/backbone.py:55:0
  %input.4 : Float(1:9600000, 64:150000, 375:400, 400:1, requires_grad=0, device=cpu) = aten::relu_(%input.3), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.relu # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:1134:0
  %200 : int = prim::Constant[value=3](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %201 : int = prim::Constant[value=3](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %202 : int[] = prim::ListConstruct(%200, %201), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool
  %203 : int = prim::Constant[value=2](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %204 : int = prim::Constant[value=2](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %205 : int[] = prim::ListConstruct(%203, %204), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool
  %206 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %207 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %208 : int[] = prim::ListConstruct(%206, %207), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool
  %209 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %210 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %211 : int[] = prim::ListConstruct(%209, %210), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool
  %212 : bool = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %input.5 : Float(1:2406400, 64:37600, 188:200, 200:1, requires_grad=0, device=cpu) = aten::max_pool2d(%input.4, %202, %205, %208, %211, %212), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.maxpool # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/functional.py:585:0
  %214 : __torch__.torchvision.models.resnet.___torch_mangle_169.Bottleneck = prim::GetAttr[name="2"](%134)
  %215 : __torch__.torchvision.models.resnet.___torch_mangle_161.Bottleneck = prim::GetAttr[name="1"](%134)
  %216 : __torch__.torchvision.models.resnet.Bottleneck = prim::GetAttr[name="0"](%134)
  %217 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="downsample"](%216)
  %218 : __torch__.models.backbone.___torch_mangle_150.FrozenBatchNorm2d = prim::GetAttr[name="bn3"](%216)
  %219 : __torch__.torch.nn.modules.conv.___torch_mangle_149.Conv2d = prim::GetAttr[name="conv3"](%216)
  %220 : __torch__.models.backbone.___torch_mangle_148.FrozenBatchNorm2d = prim::GetAttr[name="bn2"](%216)
  %221 : __torch__.torch.nn.modules.conv.___torch_mangle_147.Conv2d = prim::GetAttr[name="conv2"](%216)
  %222 : __torch__.torch.nn.modules.activation.___torch_mangle_151.ReLU = prim::GetAttr[name="relu"](%216)
  %223 : __torch__.models.backbone.___torch_mangle_146.FrozenBatchNorm2d = prim::GetAttr[name="bn1"](%216)
  %224 : __torch__.torch.nn.modules.conv.___torch_mangle_145.Conv2d = prim::GetAttr[name="conv1"](%216)
  %225 : Tensor = prim::GetAttr[name="weight"](%224)
  %226 : None = prim::Constant(), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1
  %227 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %228 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %229 : int[] = prim::ListConstruct(%227, %228), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1
  %230 : int = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %231 : int = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %232 : int[] = prim::ListConstruct(%230, %231), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1
  %233 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %234 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %235 : int[] = prim::ListConstruct(%233, %234), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1
  %236 : bool = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %237 : int = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %238 : int = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %239 : int[] = prim::ListConstruct(%237, %238), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1
  %240 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %241 : bool = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %242 : bool = prim::Constant[value=0](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %243 : bool = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %244 : bool = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %x.2 : Float(1:2406400, 64:37600, 188:200, 200:1, requires_grad=0, device=cpu) = aten::_convolution(%input.5, %225, %226, %229, %232, %235, %236, %239, %240, %241, %242, %243, %244), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.conv1 # /home/masa/anaconda3/envs/torch-1.7/lib/python3.8/site-packages/torch/nn/modules/conv.py:419:0
  %246 : Tensor = prim::GetAttr[name="running_mean"](%223)
  %247 : Tensor = prim::GetAttr[name="running_var"](%223)
  %248 : Tensor = prim::GetAttr[name="bias"](%223)
  %249 : Tensor = prim::GetAttr[name="weight"](%223)
  %250 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:48:0
  %251 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:48:0
  %252 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:48:0
  %253 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:48:0
  %254 : int[] = prim::ListConstruct(%250, %251, %252, %253), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1
  %w.2 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%249, %254), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:48:0
  %256 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:49:0
  %257 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:49:0
  %258 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:49:0
  %259 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:49:0
  %260 : int[] = prim::ListConstruct(%256, %257, %258, %259), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1
  %b.2 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%248, %260), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:49:0
  %262 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:50:0
  %263 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:50:0
  %264 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:50:0
  %265 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:50:0
  %266 : int[] = prim::ListConstruct(%262, %263, %264, %265), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1
  %rv.2 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%247, %266), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:50:0
  %268 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:51:0
  %269 : int = prim::Constant[value=-1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:51:0
  %270 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:51:0
  %271 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:51:0
  %272 : int[] = prim::ListConstruct(%268, %269, %270, %271), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1
  %rm.2 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::reshape(%246, %272), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:51:0
  %274 : Double(requires_grad=0, device=cpu) = prim::Constant[value={1e-05}](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:53:0
  %275 : int = prim::Constant[value=1](), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:53:0
  %276 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::add(%rv.2, %274, %275), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:53:0
  %277 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::rsqrt(%276), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:53:0
  %scale.2 : Float(1:64, 64:1, 1:1, 1:1, requires_grad=0, device=cpu) = aten::mul(%w.2, %277), scope: __module.model/__module.model.backbone/__module.model.backbone.0/__module.model.backbone.0.body/__module.model.backbone.0.body.layer1/__module.model.backbone.0.body.layer1.0/__module.model.backbone.0.body.layer1.0.bn1 # ../../ml/detr/models/backbone.py:53:0
