def @main(%input0: Tensor[(1, 3, 416, 416), float32], %model.model.backbone.body.0.conv.conv.weight: Tensor[(32, 12, 3, 3), float32], %model.model.backbone.body.0.conv.bn.weight: Tensor[(32), float32], %model.model.backbone.body.0.conv.bn.bias: Tensor[(32), float32], %model.model.backbone.body.0.conv.bn.running_mean: Tensor[(32), float32], %model.model.backbone.body.0.conv.bn.running_var: Tensor[(32), float32], %model.model.backbone.body.1.conv.weight: Tensor[(64, 32, 3, 3), float32], %model.model.backbone.body.1.bn.weight: Tensor[(64), float32], %model.model.backbone.body.1.bn.bias: Tensor[(64), float32], %model.model.backbone.body.1.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.1.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.2.cv1.conv.weight: Tensor[(32, 64, 1, 1), float32], %model.model.backbone.body.2.cv1.bn.weight: Tensor[(32), float32], %model.model.backbone.body.2.cv1.bn.bias: Tensor[(32), float32], %model.model.backbone.body.2.cv1.bn.running_mean: Tensor[(32), float32], %model.model.backbone.body.2.cv1.bn.running_var: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv1.conv.weight: Tensor[(32, 32, 1, 1), float32], %model.model.backbone.body.2.m.0.cv1.bn.weight: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv1.bn.bias: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv1.bn.running_mean: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv1.bn.running_var: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv2.conv.weight: Tensor[(32, 32, 3, 3), float32], %model.model.backbone.body.2.m.0.cv2.bn.weight: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv2.bn.bias: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv2.bn.running_mean: Tensor[(32), float32], %model.model.backbone.body.2.m.0.cv2.bn.running_var: Tensor[(32), float32], %model.model.backbone.body.2.cv3.weight: Tensor[(32, 32, 1, 1), float32], %model.model.backbone.body.2.cv2.weight: Tensor[(32, 64, 1, 1), float32], %model.model.backbone.body.2.bn.weight: Tensor[(64), float32], %model.model.backbone.body.2.bn.bias: Tensor[(64), float32], %model.model.backbone.body.2.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.2.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.2.cv4.conv.weight: Tensor[(64, 64, 1, 1), float32], %model.model.backbone.body.2.cv4.bn.weight: Tensor[(64), float32], %model.model.backbone.body.2.cv4.bn.bias: Tensor[(64), float32], %model.model.backbone.body.2.cv4.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.2.cv4.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.3.conv.weight: Tensor[(128, 64, 3, 3), float32], %model.model.backbone.body.3.bn.weight: Tensor[(128), float32], %model.model.backbone.body.3.bn.bias: Tensor[(128), float32], %model.model.backbone.body.3.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.3.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.4.cv1.conv.weight: Tensor[(64, 128, 1, 1), float32], %model.model.backbone.body.4.cv1.bn.weight: Tensor[(64), float32], %model.model.backbone.body.4.cv1.bn.bias: Tensor[(64), float32], %model.model.backbone.body.4.cv1.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.4.cv1.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv1.conv.weight: Tensor[(64, 64, 1, 1), float32], %model.model.backbone.body.4.m.0.cv1.bn.weight: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv1.bn.bias: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv1.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv1.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv2.conv.weight: Tensor[(64, 64, 3, 3), float32], %model.model.backbone.body.4.m.0.cv2.bn.weight: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv2.bn.bias: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv2.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.4.m.0.cv2.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv1.conv.weight: Tensor[(64, 64, 1, 1), float32], %model.model.backbone.body.4.m.1.cv1.bn.weight: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv1.bn.bias: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv1.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv1.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv2.conv.weight: Tensor[(64, 64, 3, 3), float32], %model.model.backbone.body.4.m.1.cv2.bn.weight: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv2.bn.bias: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv2.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.4.m.1.cv2.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv1.conv.weight: Tensor[(64, 64, 1, 1), float32], %model.model.backbone.body.4.m.2.cv1.bn.weight: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv1.bn.bias: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv1.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv1.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv2.conv.weight: Tensor[(64, 64, 3, 3), float32], %model.model.backbone.body.4.m.2.cv2.bn.weight: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv2.bn.bias: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv2.bn.running_mean: Tensor[(64), float32], %model.model.backbone.body.4.m.2.cv2.bn.running_var: Tensor[(64), float32], %model.model.backbone.body.4.cv3.weight: Tensor[(64, 64, 1, 1), float32], %model.model.backbone.body.4.cv2.weight: Tensor[(64, 128, 1, 1), float32], %model.model.backbone.body.4.bn.weight: Tensor[(128), float32], %model.model.backbone.body.4.bn.bias: Tensor[(128), float32], %model.model.backbone.body.4.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.4.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.4.cv4.conv.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.body.4.cv4.bn.weight: Tensor[(128), float32], %model.model.backbone.body.4.cv4.bn.bias: Tensor[(128), float32], %model.model.backbone.body.4.cv4.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.4.cv4.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.5.conv.weight: Tensor[(256, 128, 3, 3), float32], %model.model.backbone.body.5.bn.weight: Tensor[(256), float32], %model.model.backbone.body.5.bn.bias: Tensor[(256), float32], %model.model.backbone.body.5.bn.running_mean: Tensor[(256), float32], %model.model.backbone.body.5.bn.running_var: Tensor[(256), float32], %model.model.backbone.body.6.cv1.conv.weight: Tensor[(128, 256, 1, 1), float32], %model.model.backbone.body.6.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.body.6.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.body.6.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.6.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv1.conv.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.body.6.m.0.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv2.conv.weight: Tensor[(128, 128, 3, 3), float32], %model.model.backbone.body.6.m.0.cv2.bn.weight: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv2.bn.bias: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv2.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.6.m.0.cv2.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv1.conv.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.body.6.m.1.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv2.conv.weight: Tensor[(128, 128, 3, 3), float32], %model.model.backbone.body.6.m.1.cv2.bn.weight: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv2.bn.bias: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv2.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.6.m.1.cv2.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv1.conv.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.body.6.m.2.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv2.conv.weight: Tensor[(128, 128, 3, 3), float32], %model.model.backbone.body.6.m.2.cv2.bn.weight: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv2.bn.bias: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv2.bn.running_mean: Tensor[(128), float32], %model.model.backbone.body.6.m.2.cv2.bn.running_var: Tensor[(128), float32], %model.model.backbone.body.6.cv3.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.body.6.cv2.weight: Tensor[(128, 256, 1, 1), float32], %model.model.backbone.body.6.bn.weight: Tensor[(256), float32], %model.model.backbone.body.6.bn.bias: Tensor[(256), float32], %model.model.backbone.body.6.bn.running_mean: Tensor[(256), float32], %model.model.backbone.body.6.bn.running_var: Tensor[(256), float32], %model.model.backbone.body.6.cv4.conv.weight: Tensor[(256, 256, 1, 1), float32], %model.model.backbone.body.6.cv4.bn.weight: Tensor[(256), float32], %model.model.backbone.body.6.cv4.bn.bias: Tensor[(256), float32], %model.model.backbone.body.6.cv4.bn.running_mean: Tensor[(256), float32], %model.model.backbone.body.6.cv4.bn.running_var: Tensor[(256), float32], %model.model.backbone.body.7.conv.weight: Tensor[(512, 256, 3, 3), float32], %model.model.backbone.body.7.bn.weight: Tensor[(512), float32], %model.model.backbone.body.7.bn.bias: Tensor[(512), float32], %model.model.backbone.body.7.bn.running_mean: Tensor[(512), float32], %model.model.backbone.body.7.bn.running_var: Tensor[(512), float32], %model.model.backbone.body.8.cv1.conv.weight: Tensor[(256, 512, 1, 1), float32], %model.model.backbone.body.8.cv1.bn.weight: Tensor[(256), float32], %model.model.backbone.body.8.cv1.bn.bias: Tensor[(256), float32], %model.model.backbone.body.8.cv1.bn.running_mean: Tensor[(256), float32], %model.model.backbone.body.8.cv1.bn.running_var: Tensor[(256), float32], %model.model.backbone.body.8.cv2.conv.weight: Tensor[(512, 1024, 1, 1), float32], %model.model.backbone.body.8.cv2.bn.weight: Tensor[(512), float32], %model.model.backbone.body.8.cv2.bn.bias: Tensor[(512), float32], %model.model.backbone.body.8.cv2.bn.running_mean: Tensor[(512), float32], %model.model.backbone.body.8.cv2.bn.running_var: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.cv1.conv.weight: Tensor[(256, 512, 1, 1), float32], %model.model.backbone.pan.inner_blocks.0.cv1.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.cv1.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.cv1.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.cv1.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv1.conv.weight: Tensor[(256, 256, 1, 1), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv1.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv1.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv1.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv1.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv2.conv.weight: Tensor[(256, 256, 3, 3), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv2.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv2.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv2.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.m.0.cv2.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.0.cv3.weight: Tensor[(256, 256, 1, 1), float32], %model.model.backbone.pan.inner_blocks.0.cv2.weight: Tensor[(256, 512, 1, 1), float32], %model.model.backbone.pan.inner_blocks.0.bn.weight: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.bn.bias: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.bn.running_mean: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.bn.running_var: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.cv4.conv.weight: Tensor[(512, 512, 1, 1), float32], %model.model.backbone.pan.inner_blocks.0.cv4.bn.weight: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.cv4.bn.bias: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.cv4.bn.running_mean: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.0.cv4.bn.running_var: Tensor[(512), float32], %model.model.backbone.pan.inner_blocks.1.conv.weight: Tensor[(256, 512, 1, 1), float32], %model.model.backbone.pan.inner_blocks.1.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.1.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.1.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.1.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.cv1.conv.weight: Tensor[(128, 512, 1, 1), float32], %model.model.backbone.pan.inner_blocks.3.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv1.conv.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv2.conv.weight: Tensor[(128, 128, 3, 3), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv2.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv2.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv2.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.m.0.cv2.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.3.cv3.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.pan.inner_blocks.3.cv2.weight: Tensor[(128, 512, 1, 1), float32], %model.model.backbone.pan.inner_blocks.3.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.cv4.conv.weight: Tensor[(256, 256, 1, 1), float32], %model.model.backbone.pan.inner_blocks.3.cv4.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.cv4.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.cv4.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.3.cv4.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.inner_blocks.4.conv.weight: Tensor[(128, 256, 1, 1), float32], %model.model.backbone.pan.inner_blocks.4.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.4.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.4.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.inner_blocks.4.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.cv1.conv.weight: Tensor[(64, 256, 1, 1), float32], %model.model.backbone.pan.layer_blocks.0.cv1.bn.weight: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.cv1.bn.bias: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.cv1.bn.running_mean: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.cv1.bn.running_var: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv1.conv.weight: Tensor[(64, 64, 1, 1), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv1.bn.weight: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv1.bn.bias: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv1.bn.running_mean: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv1.bn.running_var: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv2.conv.weight: Tensor[(64, 64, 3, 3), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv2.bn.weight: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv2.bn.bias: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv2.bn.running_mean: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.m.0.cv2.bn.running_var: Tensor[(64), float32], %model.model.backbone.pan.layer_blocks.0.cv3.weight: Tensor[(64, 64, 1, 1), float32], %model.model.backbone.pan.layer_blocks.0.cv2.weight: Tensor[(64, 256, 1, 1), float32], %model.model.backbone.pan.layer_blocks.0.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.cv4.conv.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.pan.layer_blocks.0.cv4.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.cv4.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.cv4.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.0.cv4.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.1.conv.weight: Tensor[(128, 128, 3, 3), float32], %model.model.backbone.pan.layer_blocks.1.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.1.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.1.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.cv1.conv.weight: Tensor[(128, 256, 1, 1), float32], %model.model.backbone.pan.layer_blocks.2.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv1.conv.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv1.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv1.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv1.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv1.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv2.conv.weight: Tensor[(128, 128, 3, 3), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv2.bn.weight: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv2.bn.bias: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv2.bn.running_mean: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.m.0.cv2.bn.running_var: Tensor[(128), float32], %model.model.backbone.pan.layer_blocks.2.cv3.weight: Tensor[(128, 128, 1, 1), float32], %model.model.backbone.pan.layer_blocks.2.cv2.weight: Tensor[(128, 256, 1, 1), float32], %model.model.backbone.pan.layer_blocks.2.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.2.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.2.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.2.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.2.cv4.conv.weight: Tensor[(256, 256, 1, 1), float32], %model.model.backbone.pan.layer_blocks.2.cv4.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.2.cv4.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.2.cv4.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.2.cv4.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.3.conv.weight: Tensor[(256, 256, 3, 3), float32], %model.model.backbone.pan.layer_blocks.3.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.3.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.3.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.3.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.cv1.conv.weight: Tensor[(256, 512, 1, 1), float32], %model.model.backbone.pan.layer_blocks.4.cv1.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.cv1.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.cv1.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.cv1.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv1.conv.weight: Tensor[(256, 256, 1, 1), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv1.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv1.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv1.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv1.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv2.conv.weight: Tensor[(256, 256, 3, 3), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv2.bn.weight: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv2.bn.bias: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv2.bn.running_mean: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.m.0.cv2.bn.running_var: Tensor[(256), float32], %model.model.backbone.pan.layer_blocks.4.cv3.weight: Tensor[(256, 256, 1, 1), float32], %model.model.backbone.pan.layer_blocks.4.cv2.weight: Tensor[(256, 512, 1, 1), float32], %model.model.backbone.pan.layer_blocks.4.bn.weight: Tensor[(512), float32], %model.model.backbone.pan.layer_blocks.4.bn.bias: Tensor[(512), float32], %model.model.backbone.pan.layer_blocks.4.bn.running_mean: Tensor[(512), float32], %model.model.backbone.pan.layer_blocks.4.bn.running_var: Tensor[(512), float32], %model.model.backbone.pan.layer_blocks.4.cv4.conv.weight: Tensor[(512, 512, 1, 1), float32], %model.model.backbone.pan.layer_blocks.4.cv4.bn.weight: Tensor[(512), float32], %model.model.backbone.pan.layer_blocks.4.cv4.bn.bias: Tensor[(512), float32], %model.model.backbone.pan.layer_blocks.4.cv4.bn.running_mean: Tensor[(512), float32], %model.model.backbone.pan.layer_blocks.4.cv4.bn.running_var: Tensor[(512), float32], %model.model.head.head.0.weight: Tensor[(255, 128, 1, 1), float32], %model.model.head.head.0.bias: Tensor[(255), float32], %model.model.head.head.1.weight: Tensor[(255, 256, 1, 1), float32], %model.model.head.head.1.bias: Tensor[(255), float32], %model.model.head.head.2.weight: Tensor[(255, 512, 1, 1), float32], %model.model.head.head.2.bias: Tensor[(255), float32]) -> (Tensor[(?, 4), float32], Tensor[(?), float32], Tensor[(?), int64]) {
  %0 = split(%input0, indices_or_sections=1) /* ty=(Tensor[(1, 3, 416, 416), float32],) */;
  %1 = %0.0;
  %2 = squeeze(%1, axis=[0]) /* ty=Tensor[(3, 416, 416), float32] */;
  %3 = (%2,);
  %4 = %3.0;
  %5 = expand_dims(%4, axis=0) /* ty=Tensor[(1, 3, 416, 416), float32] */;
  %6 = image.resize(%5, size=[320, 320], rounding_method="") /* ty=Tensor[(1, 3, 320, 320), float32] */;
  %7 = take(%6, 0 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(3, 320, 320), float32] */;
  %8 = nn.pad(%7, 0 /* ty=int32 */, pad_width=[[0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(3, 320, 320), float32] */;
  %9 = (%8,);
  %10 = stack(%9) /* ty=Tensor[(1, 3, 320, 320), float32] */;
  %11 = (%10, 320 /* ty=int32 */, 320 /* ty=int32 */);
  %12 = %11.0;
  %13 = strided_slice(%12, begin=[0, 0, 0, 0], end=[1, 3, 320, 320], strides=[1, 1, 2, 1]) /* ty=Tensor[(1, 3, 160, 320), float32] */;
  %14 = strided_slice(%12, begin=[0, 0, 1, 0], end=[1, 3, 320, 320], strides=[1, 1, 2, 1]) /* ty=Tensor[(1, 3, 160, 320), float32] */;
  %15 = strided_slice(%12, begin=[0, 0, 0, 0], end=[1, 3, 320, 320], strides=[1, 1, 2, 1]) /* ty=Tensor[(1, 3, 160, 320), float32] */;
  %16 = strided_slice(%12, begin=[0, 0, 1, 0], end=[1, 3, 320, 320], strides=[1, 1, 2, 1]) /* ty=Tensor[(1, 3, 160, 320), float32] */;
  %17 = strided_slice(%13, begin=[0, 0, 0, 0], end=[1, 3, 160, 320], strides=[1, 1, 1, 2]) /* ty=Tensor[(1, 3, 160, 160), float32] */;
  %18 = strided_slice(%14, begin=[0, 0, 0, 0], end=[1, 3, 160, 320], strides=[1, 1, 1, 2]) /* ty=Tensor[(1, 3, 160, 160), float32] */;
  %19 = strided_slice(%15, begin=[0, 0, 0, 1], end=[1, 3, 160, 320], strides=[1, 1, 1, 2]) /* ty=Tensor[(1, 3, 160, 160), float32] */;
  %20 = strided_slice(%16, begin=[0, 0, 0, 1], end=[1, 3, 160, 320], strides=[1, 1, 1, 2]) /* ty=Tensor[(1, 3, 160, 160), float32] */;
  %21 = (%17, %18, %19, %20);
  %22 = concatenate(%21, axis=1) /* ty=Tensor[(1, 12, 160, 160), float32] */;
  %23 = nn.conv2d(%22, %model.model.backbone.body.0.conv.conv.weight, padding=[1, 1, 1, 1], channels=32, kernel_size=[3, 3]) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %24 = nn.batch_norm(%23, %model.model.backbone.body.0.conv.bn.weight, %model.model.backbone.body.0.conv.bn.bias, %model.model.backbone.body.0.conv.bn.running_mean, %model.model.backbone.body.0.conv.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 32, 160, 160), float32], Tensor[(32), float32], Tensor[(32), float32]) */;
  %25 = %24.0;
  %26 = add(%25, 3f /* ty=float32 */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %27 = clip(%26, a_min=0f, a_max=6f) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %28 = multiply(%25, %27) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %29 = divide(%28, 6f /* ty=float32 */) /* ty=Tensor[(1, 32, 160, 160), float32] */;
  %30 = nn.conv2d(%29, %model.model.backbone.body.1.conv.weight, strides=[2, 2], padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %31 = nn.batch_norm(%30, %model.model.backbone.body.1.bn.weight, %model.model.backbone.body.1.bn.bias, %model.model.backbone.body.1.bn.running_mean, %model.model.backbone.body.1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 80, 80), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %32 = %31.0;
  %33 = add(%32, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %34 = clip(%33, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %35 = multiply(%32, %34) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %36 = divide(%35, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %37 = nn.conv2d(%36, %model.model.backbone.body.2.cv1.conv.weight, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %38 = nn.batch_norm(%37, %model.model.backbone.body.2.cv1.bn.weight, %model.model.backbone.body.2.cv1.bn.bias, %model.model.backbone.body.2.cv1.bn.running_mean, %model.model.backbone.body.2.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 32, 80, 80), float32], Tensor[(32), float32], Tensor[(32), float32]) */;
  %39 = %38.0;
  %40 = add(%39, 3f /* ty=float32 */) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %41 = clip(%40, a_min=0f, a_max=6f) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %42 = multiply(%39, %41) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %43 = divide(%42, 6f /* ty=float32 */) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %44 = nn.conv2d(%43, %model.model.backbone.body.2.m.0.cv1.conv.weight, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %45 = nn.batch_norm(%44, %model.model.backbone.body.2.m.0.cv1.bn.weight, %model.model.backbone.body.2.m.0.cv1.bn.bias, %model.model.backbone.body.2.m.0.cv1.bn.running_mean, %model.model.backbone.body.2.m.0.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 32, 80, 80), float32], Tensor[(32), float32], Tensor[(32), float32]) */;
  %46 = %45.0;
  %47 = add(%46, 3f /* ty=float32 */) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %48 = clip(%47, a_min=0f, a_max=6f) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %49 = multiply(%46, %48) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %50 = divide(%49, 6f /* ty=float32 */) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %51 = nn.conv2d(%50, %model.model.backbone.body.2.m.0.cv2.conv.weight, padding=[1, 1, 1, 1], channels=32, kernel_size=[3, 3]) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %52 = nn.batch_norm(%51, %model.model.backbone.body.2.m.0.cv2.bn.weight, %model.model.backbone.body.2.m.0.cv2.bn.bias, %model.model.backbone.body.2.m.0.cv2.bn.running_mean, %model.model.backbone.body.2.m.0.cv2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 32, 80, 80), float32], Tensor[(32), float32], Tensor[(32), float32]) */;
  %53 = %52.0;
  %54 = add(%53, 3f /* ty=float32 */) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %55 = clip(%54, a_min=0f, a_max=6f) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %56 = multiply(%53, %55) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %57 = divide(%56, 6f /* ty=float32 */) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %58 = add(%43, %57) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %59 = nn.conv2d(%58, %model.model.backbone.body.2.cv3.weight, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %60 = nn.conv2d(%36, %model.model.backbone.body.2.cv2.weight, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 80, 80), float32] */;
  %61 = (%59, %60);
  %62 = concatenate(%61, axis=1) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %63 = nn.batch_norm(%62, %model.model.backbone.body.2.bn.weight, %model.model.backbone.body.2.bn.bias, %model.model.backbone.body.2.bn.running_mean, %model.model.backbone.body.2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 80, 80), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %64 = %63.0;
  %65 = nn.leaky_relu(%64, alpha=0.1f) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %66 = nn.conv2d(%65, %model.model.backbone.body.2.cv4.conv.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %67 = nn.batch_norm(%66, %model.model.backbone.body.2.cv4.bn.weight, %model.model.backbone.body.2.cv4.bn.bias, %model.model.backbone.body.2.cv4.bn.running_mean, %model.model.backbone.body.2.cv4.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 80, 80), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %68 = %67.0;
  %69 = add(%68, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %70 = clip(%69, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %71 = multiply(%68, %70) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %72 = divide(%71, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 80, 80), float32] */;
  %73 = nn.conv2d(%72, %model.model.backbone.body.3.conv.weight, strides=[2, 2], padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %74 = nn.batch_norm(%73, %model.model.backbone.body.3.bn.weight, %model.model.backbone.body.3.bn.bias, %model.model.backbone.body.3.bn.running_mean, %model.model.backbone.body.3.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 40, 40), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %75 = %74.0;
  %76 = add(%75, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %77 = clip(%76, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %78 = multiply(%75, %77) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %79 = divide(%78, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %80 = nn.conv2d(%79, %model.model.backbone.body.4.cv1.conv.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %81 = nn.batch_norm(%80, %model.model.backbone.body.4.cv1.bn.weight, %model.model.backbone.body.4.cv1.bn.bias, %model.model.backbone.body.4.cv1.bn.running_mean, %model.model.backbone.body.4.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 40, 40), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %82 = %81.0;
  %83 = add(%82, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %84 = clip(%83, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %85 = multiply(%82, %84) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %86 = divide(%85, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %87 = nn.conv2d(%86, %model.model.backbone.body.4.m.0.cv1.conv.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %88 = nn.batch_norm(%87, %model.model.backbone.body.4.m.0.cv1.bn.weight, %model.model.backbone.body.4.m.0.cv1.bn.bias, %model.model.backbone.body.4.m.0.cv1.bn.running_mean, %model.model.backbone.body.4.m.0.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 40, 40), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %89 = %88.0;
  %90 = add(%89, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %91 = clip(%90, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %92 = multiply(%89, %91) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %93 = divide(%92, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %94 = nn.conv2d(%93, %model.model.backbone.body.4.m.0.cv2.conv.weight, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %95 = nn.batch_norm(%94, %model.model.backbone.body.4.m.0.cv2.bn.weight, %model.model.backbone.body.4.m.0.cv2.bn.bias, %model.model.backbone.body.4.m.0.cv2.bn.running_mean, %model.model.backbone.body.4.m.0.cv2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 40, 40), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %96 = %95.0;
  %97 = add(%96, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %98 = clip(%97, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %99 = multiply(%96, %98) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %100 = divide(%99, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %101 = add(%86, %100) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %102 = nn.conv2d(%101, %model.model.backbone.body.4.m.1.cv1.conv.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %103 = nn.batch_norm(%102, %model.model.backbone.body.4.m.1.cv1.bn.weight, %model.model.backbone.body.4.m.1.cv1.bn.bias, %model.model.backbone.body.4.m.1.cv1.bn.running_mean, %model.model.backbone.body.4.m.1.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 40, 40), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %104 = %103.0;
  %105 = add(%104, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %106 = clip(%105, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %107 = multiply(%104, %106) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %108 = divide(%107, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %109 = nn.conv2d(%108, %model.model.backbone.body.4.m.1.cv2.conv.weight, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %110 = nn.batch_norm(%109, %model.model.backbone.body.4.m.1.cv2.bn.weight, %model.model.backbone.body.4.m.1.cv2.bn.bias, %model.model.backbone.body.4.m.1.cv2.bn.running_mean, %model.model.backbone.body.4.m.1.cv2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 40, 40), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %111 = %110.0;
  %112 = add(%111, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %113 = clip(%112, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %114 = multiply(%111, %113) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %115 = divide(%114, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %116 = add(%101, %115) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %117 = nn.conv2d(%116, %model.model.backbone.body.4.m.2.cv1.conv.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %118 = nn.batch_norm(%117, %model.model.backbone.body.4.m.2.cv1.bn.weight, %model.model.backbone.body.4.m.2.cv1.bn.bias, %model.model.backbone.body.4.m.2.cv1.bn.running_mean, %model.model.backbone.body.4.m.2.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 40, 40), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %119 = %118.0;
  %120 = add(%119, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %121 = clip(%120, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %122 = multiply(%119, %121) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %123 = divide(%122, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %124 = nn.conv2d(%123, %model.model.backbone.body.4.m.2.cv2.conv.weight, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %125 = nn.batch_norm(%124, %model.model.backbone.body.4.m.2.cv2.bn.weight, %model.model.backbone.body.4.m.2.cv2.bn.bias, %model.model.backbone.body.4.m.2.cv2.bn.running_mean, %model.model.backbone.body.4.m.2.cv2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 64, 40, 40), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %126 = %125.0;
  %127 = add(%126, 3f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %128 = clip(%127, a_min=0f, a_max=6f) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %129 = multiply(%126, %128) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %130 = divide(%129, 6f /* ty=float32 */) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %131 = add(%116, %130) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %132 = nn.conv2d(%131, %model.model.backbone.body.4.cv3.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %133 = nn.conv2d(%79, %model.model.backbone.body.4.cv2.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 40, 40), float32] */;
  %134 = (%132, %133);
  %135 = concatenate(%134, axis=1) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %136 = nn.batch_norm(%135, %model.model.backbone.body.4.bn.weight, %model.model.backbone.body.4.bn.bias, %model.model.backbone.body.4.bn.running_mean, %model.model.backbone.body.4.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 40, 40), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %137 = %136.0;
  %138 = nn.leaky_relu(%137, alpha=0.1f) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %139 = nn.conv2d(%138, %model.model.backbone.body.4.cv4.conv.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %140 = nn.batch_norm(%139, %model.model.backbone.body.4.cv4.bn.weight, %model.model.backbone.body.4.cv4.bn.bias, %model.model.backbone.body.4.cv4.bn.running_mean, %model.model.backbone.body.4.cv4.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 40, 40), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %141 = %140.0;
  %142 = add(%141, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %143 = clip(%142, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %144 = multiply(%141, %143) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %145 = divide(%144, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 40, 40), float32] */;
  %146 = nn.conv2d(%145, %model.model.backbone.body.5.conv.weight, strides=[2, 2], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %147 = nn.batch_norm(%146, %model.model.backbone.body.5.bn.weight, %model.model.backbone.body.5.bn.bias, %model.model.backbone.body.5.bn.running_mean, %model.model.backbone.body.5.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 256, 20, 20), float32], Tensor[(256), float32], Tensor[(256), float32]) */;
  %148 = %147.0;
  %149 = add(%148, 3f /* ty=float32 */) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %150 = clip(%149, a_min=0f, a_max=6f) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %151 = multiply(%148, %150) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %152 = divide(%151, 6f /* ty=float32 */) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %153 = nn.conv2d(%152, %model.model.backbone.body.6.cv1.conv.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %154 = nn.batch_norm(%153, %model.model.backbone.body.6.cv1.bn.weight, %model.model.backbone.body.6.cv1.bn.bias, %model.model.backbone.body.6.cv1.bn.running_mean, %model.model.backbone.body.6.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %155 = %154.0;
  %156 = add(%155, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %157 = clip(%156, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %158 = multiply(%155, %157) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %159 = divide(%158, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %160 = nn.conv2d(%159, %model.model.backbone.body.6.m.0.cv1.conv.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %161 = nn.batch_norm(%160, %model.model.backbone.body.6.m.0.cv1.bn.weight, %model.model.backbone.body.6.m.0.cv1.bn.bias, %model.model.backbone.body.6.m.0.cv1.bn.running_mean, %model.model.backbone.body.6.m.0.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %162 = %161.0;
  %163 = add(%162, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %164 = clip(%163, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %165 = multiply(%162, %164) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %166 = divide(%165, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %167 = nn.conv2d(%166, %model.model.backbone.body.6.m.0.cv2.conv.weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %168 = nn.batch_norm(%167, %model.model.backbone.body.6.m.0.cv2.bn.weight, %model.model.backbone.body.6.m.0.cv2.bn.bias, %model.model.backbone.body.6.m.0.cv2.bn.running_mean, %model.model.backbone.body.6.m.0.cv2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %169 = %168.0;
  %170 = add(%169, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %171 = clip(%170, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %172 = multiply(%169, %171) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %173 = divide(%172, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %174 = add(%159, %173) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %175 = nn.conv2d(%174, %model.model.backbone.body.6.m.1.cv1.conv.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %176 = nn.batch_norm(%175, %model.model.backbone.body.6.m.1.cv1.bn.weight, %model.model.backbone.body.6.m.1.cv1.bn.bias, %model.model.backbone.body.6.m.1.cv1.bn.running_mean, %model.model.backbone.body.6.m.1.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %177 = %176.0;
  %178 = add(%177, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %179 = clip(%178, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %180 = multiply(%177, %179) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %181 = divide(%180, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %182 = nn.conv2d(%181, %model.model.backbone.body.6.m.1.cv2.conv.weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %183 = nn.batch_norm(%182, %model.model.backbone.body.6.m.1.cv2.bn.weight, %model.model.backbone.body.6.m.1.cv2.bn.bias, %model.model.backbone.body.6.m.1.cv2.bn.running_mean, %model.model.backbone.body.6.m.1.cv2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %184 = %183.0;
  %185 = add(%184, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %186 = clip(%185, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %187 = multiply(%184, %186) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %188 = divide(%187, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %189 = add(%174, %188) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %190 = nn.conv2d(%189, %model.model.backbone.body.6.m.2.cv1.conv.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %191 = nn.batch_norm(%190, %model.model.backbone.body.6.m.2.cv1.bn.weight, %model.model.backbone.body.6.m.2.cv1.bn.bias, %model.model.backbone.body.6.m.2.cv1.bn.running_mean, %model.model.backbone.body.6.m.2.cv1.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %192 = %191.0;
  %193 = add(%192, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %194 = clip(%193, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %195 = multiply(%192, %194) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %196 = divide(%195, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %197 = nn.conv2d(%196, %model.model.backbone.body.6.m.2.cv2.conv.weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %198 = nn.batch_norm(%197, %model.model.backbone.body.6.m.2.cv2.bn.weight, %model.model.backbone.body.6.m.2.cv2.bn.bias, %model.model.backbone.body.6.m.2.cv2.bn.running_mean, %model.model.backbone.body.6.m.2.cv2.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 128, 20, 20), float32], Tensor[(128), float32], Tensor[(128), float32]) */;
  %199 = %198.0;
  %200 = add(%199, 3f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %201 = clip(%200, a_min=0f, a_max=6f) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %202 = multiply(%199, %201) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %203 = divide(%202, 6f /* ty=float32 */) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %204 = add(%189, %203) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %205 = nn.conv2d(%204, %model.model.backbone.body.6.cv3.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %206 = nn.conv2d(%152, %model.model.backbone.body.6.cv2.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 20, 20), float32] */;
  %207 = (%205, %206);
  %208 = concatenate(%207, axis=1) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %209 = nn.batch_norm(%208, %model.model.backbone.body.6.bn.weight, %model.model.backbone.body.6.bn.bias, %model.model.backbone.body.6.bn.running_mean, %model.model.backbone.body.6.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 256, 20, 20), float32], Tensor[(256), float32], Tensor[(256), float32]) */;
  %210 = %209.0;
  %211 = nn.leaky_relu(%210, alpha=0.1f) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %212 = nn.conv2d(%211, %model.model.backbone.body.6.cv4.conv.weight, padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %213 = nn.batch_norm(%212, %model.model.backbone.body.6.cv4.bn.weight, %model.model.backbone.body.6.cv4.bn.bias, %model.model.backbone.body.6.cv4.bn.running_mean, %model.model.backbone.body.6.cv4.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 256, 20, 20), float32], Tensor[(256), float32], Tensor[(256), float32]) */;
  %214 = %213.0;
  %215 = add(%214, 3f /* ty=float32 */) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %216 = clip(%215, a_min=0f, a_max=6f) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %217 = multiply(%214, %216) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %218 = divide(%217, 6f /* ty=float32 */) /* ty=Tensor[(1, 256, 20, 20), float32] */;
  %219 = nn.conv2d(%218, %model.model.backbone.body.7.conv.weight, strides=[2, 2], padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 10, 10), float32] */;
  %220 = nn.batch_norm(%219, %model.model.backbone.body.7.bn.weight, %model.model.backbone.body.7.bn.bias, %model.model.backbone.body.7.bn.running_mean, %model.model.backbone.body.7.bn.running_var, epsilon=0.001f) /* ty=(Tensor[(1, 512, 10, 10), float32], Tensor[(512), float32], Tensor[(512), float32]) */;
  %221 = %220.0;
