def @main(%input0: Tensor[(1, 3, 224, 224), float32], param_device_types=[7], result_device_type=7, hash="a9641d3662edc91c") -> Tensor[(1, 1000), float32] {
  %541 = fn (%p0219: Tensor[(1, 3, 224, 224), float32], %p1165: Tensor[(96, 3, 4, 4), float32], %p259: Tensor[(1, 96, 1, 1), float32], hash="d2eebe129c010f45", out_layout="", kernel_layout="OIHW", Primitive=1, data_layout="NCHW") -> Tensor[(1, 96, 56, 56), float32] {
    %540 = nn.conv2d(%p0219, %p1165, strides=[4, 4], padding=[0, 0, 0, 0], channels=96, kernel_size=[4, 4]) /* ty=Tensor[(1, 96, 56, 56), float32] */;
    add(%540, %p259) /* ty=Tensor[(1, 96, 56, 56), float32] */
  };
  %542 = %541(%input0, meta[relay.Constant][0] /* ty=Tensor[(96, 3, 4, 4), float32] */, meta[relay.Constant][1] /* ty=Tensor[(1, 96, 1, 1), float32] */) /* ty=Tensor[(1, 96, 56, 56), float32] */;
  %543 = fn (%p0218: Tensor[(1, 96, 56, 56), float32], Primitive=1, hash="f424ceed12bbe4b1") -> Tensor[(1, 3136, 96), float32] {
    %538 = reshape(%p0218, newshape=[0, 0, -1, 1]) /* ty=Tensor[(1, 96, 3136, 1), float32] */;
    %539 = squeeze(%538, axis=[3]) /* ty=Tensor[(1, 96, 3136), float32] */;
    transpose(%539, axes=[0, 2, 1]) /* ty=Tensor[(1, 3136, 96), float32] */
  };
  %544 = %543(%542) /* ty=Tensor[(1, 3136, 96), float32] */;
  %545 = fn (%p0220: Tensor[(1, 3136, 96), float32], Primitive=1, hash="cd5fdf7b59629fe1") -> Tensor[(1, 3136, 1), float32] {
    mean(%p0220, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %546 = %545(%544) /* ty=Tensor[(1, 3136, 1), float32] */;
  %547 = fn (%p0221: Tensor[(1, 3136, 96), float32], %p1166: Tensor[(1, 3136, 1), float32], Primitive=1, hash="22de6c88dab2f4ec") -> Tensor[(1, 3136, 1), float32] {
    variance(%p0221, %p1166, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %548 = %547(%544, %546) /* ty=Tensor[(1, 3136, 1), float32] */;
  %549 = fn (%p0217: Tensor[(1, 3136, 96), float32], %p1164: Tensor[(1, 3136, 1), float32], %p258: Tensor[(1, 3136, 1), float32], %p333: Tensor[(96), float32], %p433: Tensor[(96), float32], Primitive=1, hash="ae22491cdb34e9e7") -> Tensor[(1, 3136, 96), float32] {
    %533 = add(%p258, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 3136, 1), float32] */;
    %534 = subtract(%p0217, %p1164) /* ty=Tensor[(1, 3136, 96), float32] */;
    %535 = sqrt(%533) /* ty=Tensor[(1, 3136, 1), float32] */;
    %536 = divide(%534, %535) /* ty=Tensor[(1, 3136, 96), float32] */;
    %537 = multiply(%536, %p333) /* ty=Tensor[(1, 3136, 96), float32] */;
    add(%537, %p433) /* ty=Tensor[(1, 3136, 96), float32] */
  };
  %550 = %549(%544, %546, %548, meta[relay.Constant][2] /* ty=Tensor[(96), float32] */, meta[relay.Constant][3] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(1, 3136, 96), float32] */;
  %551 = fn (%p0222: Tensor[(1, 3136, 96), float32], Primitive=1, hash="cd5fdf7b59629fe1") -> Tensor[(1, 3136, 1), float32] {
    mean(%p0222, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %552 = %551(%550) /* ty=Tensor[(1, 3136, 1), float32] */;
  %553 = fn (%p0223: Tensor[(1, 3136, 96), float32], %p1167: Tensor[(1, 3136, 1), float32], Primitive=1, hash="22de6c88dab2f4ec") -> Tensor[(1, 3136, 1), float32] {
    variance(%p0223, %p1167, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %554 = %553(%550, %552) /* ty=Tensor[(1, 3136, 1), float32] */;
  %555 = fn (%p0216: Tensor[(1, 3136, 96), float32], %p1163: Tensor[(1, 3136, 1), float32], %p257: Tensor[(1, 3136, 1), float32], %p332: Tensor[(96), float32], %p432: Tensor[(96), float32], Primitive=1, hash="7dab8057d998d1d7") -> Tensor[(3136, 96), float32] {
    %525 = add(%p257, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 3136, 1), float32] */;
    %526 = subtract(%p0216, %p1163) /* ty=Tensor[(1, 3136, 96), float32] */;
    %527 = sqrt(%525) /* ty=Tensor[(1, 3136, 1), float32] */;
    %528 = divide(%526, %527) /* ty=Tensor[(1, 3136, 96), float32] */;
    %529 = multiply(%528, %p332) /* ty=Tensor[(1, 3136, 96), float32] */;
    %530 = add(%529, %p432) /* ty=Tensor[(1, 3136, 96), float32] */;
    %531 = reshape(%530, newshape=[1, 8, 7, 8, 7, 96]) /* ty=Tensor[(1, 8, 7, 8, 7, 96), float32] */;
    %532 = transpose(%531, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 8, 8, 7, 7, 96), float32] */;
    reshape(%532, newshape=[3136, 96]) /* ty=Tensor[(3136, 96), float32] */
  };
  %556 = %555(%550, %552, %554, meta[relay.Constant][4] /* ty=Tensor[(96), float32] */, meta[relay.Constant][5] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(3136, 96), float32] */;
  %557 = fn (%p0215: Tensor[(3136, 96), float32], %p1162: Tensor[(288, 96), float32], Primitive=1, hash="303f96ca60311351") -> Tensor[(3136, 288), float32] {
    nn.dense(%p0215, %p1162, units=None) /* ty=Tensor[(3136, 288), float32] */
  };
  %558 = %557(%556, meta[relay.Constant][6] /* ty=Tensor[(288, 96), float32] */) /* ty=Tensor[(3136, 288), float32] */;
  %559 = fn (%p0214: Tensor[(3136, 288), float32], %p1161: Tensor[(288), float32], Primitive=1, hash="596d116b00403ebb") -> Tensor[(3, 64, 3, 49, 32), float32] {
    %522 = reshape(%p0214, newshape=[64, 49, 288]) /* ty=Tensor[(64, 49, 288), float32] */;
    %523 = add(%522, %p1161) /* ty=Tensor[(64, 49, 288), float32] */;
    %524 = reshape(%523, newshape=[64, 49, 3, 3, 32]) /* ty=Tensor[(64, 49, 3, 3, 32), float32] */;
    transpose(%524, axes=[2, 0, 3, 1, 4]) /* ty=Tensor[(3, 64, 3, 49, 32), float32] */
  };
  %560 = %559(%558, meta[relay.Constant][7] /* ty=Tensor[(288), float32] */) /* ty=Tensor[(3, 64, 3, 49, 32), float32] */;
  %561 = fn (%p0213: Tensor[(3, 64, 3, 49, 32), float32], Primitive=1, hash="b9c05eb76c1cdf31") -> Tensor[(192, 49, 32), float32] {
    %520 = take(%p0213, 0 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(64, 3, 49, 32), float32] */;
    %521 = multiply(%520, 0.176777f /* ty=float32 */) /* ty=Tensor[(64, 3, 49, 32), float32] */;
    reshape(%521, newshape=[-1, 49, 32]) /* ty=Tensor[(192, 49, 32), float32] */
  };
  %563 = fn (%p0224: Tensor[(3, 64, 3, 49, 32), float32], Primitive=1, hash="e81bba9fb411f52e") -> Tensor[(192, 49, 32), float32] {
    %562 = take(%p0224, 1 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(64, 3, 49, 32), float32] */;
    reshape(%562, newshape=[-1, 49, 32]) /* ty=Tensor[(192, 49, 32), float32] */
  };
  %564 = %561(%560) /* ty=Tensor[(192, 49, 32), float32] */;
  %565 = %563(%560) /* ty=Tensor[(192, 49, 32), float32] */;
  %566 = fn (%p0212: Tensor[(192, 49, 32), float32], %p1160: Tensor[(192, 49, 32), float32], Primitive=1, hash="2e83155f40aa0499") -> Tensor[(192, 49, 49), float32] {
    nn.batch_matmul(%p0212, %p1160, transpose_b=True) /* ty=Tensor[(192, 49, 49), float32] */
  };
  %567 = %566(%564, %565) /* ty=Tensor[(192, 49, 49), float32] */;
  %568 = fn (%p0211: Tensor[(192, 49, 49), float32], %p1159: Tensor[(1, 3, 49, 49), float32], Primitive=1, hash="d943704e8e9b4c1a") -> Tensor[(64, 3, 49, 49), float32] {
    %519 = reshape(%p0211, newshape=[64, 3, 49, 49]) /* ty=Tensor[(64, 3, 49, 49), float32] */;
    add(%519, %p1159) /* ty=Tensor[(64, 3, 49, 49), float32] */
  };
  %569 = %568(%567, meta[relay.Constant][8] /* ty=Tensor[(1, 3, 49, 49), float32] */) /* ty=Tensor[(64, 3, 49, 49), float32] */;
  %570 = fn (%p0210: Tensor[(64, 3, 49, 49), float32], Primitive=1, hash="5c4ac934ea983b37") -> Tensor[(64, 3, 49, 49), float32] {
    nn.softmax(%p0210) /* ty=Tensor[(64, 3, 49, 49), float32] */
  };
  %571 = %570(%569) /* ty=Tensor[(64, 3, 49, 49), float32] */;
  %572 = fn (%p0209: Tensor[(64, 3, 49, 49), float32], Primitive=1, relay.reshape_only=1, hash="b8ac7d2e67dede13") -> Tensor[(192, 49, 49), float32] {
    reshape(%p0209, newshape=[-1, 49, 49]) /* ty=Tensor[(192, 49, 49), float32] */
  };
  %575 = fn (%p0225: Tensor[(3, 64, 3, 49, 32), float32], Primitive=1, hash="568931d7bdbd42d8") -> Tensor[(192, 32, 49), float32] {
    %573 = take(%p0225, 2 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(64, 3, 49, 32), float32] */;
    %574 = transpose(%573, axes=[0, 1, 3, 2]) /* ty=Tensor[(64, 3, 32, 49), float32] */;
    reshape(%574, newshape=[-1, 32, 49]) /* ty=Tensor[(192, 32, 49), float32] */
  };
  %576 = %572(%571) /* ty=Tensor[(192, 49, 49), float32] */;
  %577 = %575(%560) /* ty=Tensor[(192, 32, 49), float32] */;
  %578 = fn (%p0208: Tensor[(192, 49, 49), float32], %p1158: Tensor[(192, 32, 49), float32], Primitive=1, hash="bc3539683fba29aa") -> Tensor[(192, 49, 32), float32] {
    nn.batch_matmul(%p0208, %p1158, transpose_b=True) /* ty=Tensor[(192, 49, 32), float32] */
  };
  %579 = %578(%576, %577) /* ty=Tensor[(192, 49, 32), float32] */;
  %580 = fn (%p0207: Tensor[(192, 49, 32), float32], Primitive=1, hash="a0cbbaea1149ac3f") -> Tensor[(3136, 96), float32] {
    %517 = reshape(%p0207, newshape=[64, 3, 49, 32]) /* ty=Tensor[(64, 3, 49, 32), float32] */;
    %518 = transpose(%517, axes=[0, 2, 1, 3]) /* ty=Tensor[(64, 49, 3, 32), float32] */;
    reshape(%518, newshape=[3136, 96]) /* ty=Tensor[(3136, 96), float32] */
  };
  %581 = %580(%579) /* ty=Tensor[(3136, 96), float32] */;
  %582 = fn (%p0206: Tensor[(3136, 96), float32], %p1157: Tensor[(96, 96), float32], Primitive=1, hash="62e6d70f0d7057b6") -> Tensor[(3136, 96), float32] {
    nn.dense(%p0206, %p1157, units=None) /* ty=Tensor[(3136, 96), float32] */
  };
  %583 = %582(%581, meta[relay.Constant][9] /* ty=Tensor[(96, 96), float32] */) /* ty=Tensor[(3136, 96), float32] */;
  %584 = fn (%p0205: Tensor[(3136, 96), float32], %p1156: Tensor[(96), float32], %p256: Tensor[(1, 3136, 96), float32], Primitive=1, hash="675dbb53ff9b0cc0") -> Tensor[(1, 3136, 96), float32] {
    %512 = reshape(%p0205, newshape=[64, 49, 96]) /* ty=Tensor[(64, 49, 96), float32] */;
    %513 = add(%512, %p1156) /* ty=Tensor[(64, 49, 96), float32] */;
    %514 = reshape(%513, newshape=[1, 8, 8, 7, 7, 96]) /* ty=Tensor[(1, 8, 8, 7, 7, 96), float32] */;
    %515 = transpose(%514, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 8, 7, 8, 7, 96), float32] */;
    %516 = reshape(%515, newshape=[1, 3136, 96]) /* ty=Tensor[(1, 3136, 96), float32] */;
    add(%p256, %516) /* ty=Tensor[(1, 3136, 96), float32] */
  };
  %585 = %584(%583, meta[relay.Constant][10] /* ty=Tensor[(96), float32] */, %550) /* ty=Tensor[(1, 3136, 96), float32] */;
  %586 = fn (%p0226: Tensor[(1, 3136, 96), float32], Primitive=1, hash="cd5fdf7b59629fe1") -> Tensor[(1, 3136, 1), float32] {
    mean(%p0226, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %587 = %586(%585) /* ty=Tensor[(1, 3136, 1), float32] */;
  %588 = fn (%p0227: Tensor[(1, 3136, 96), float32], %p1168: Tensor[(1, 3136, 1), float32], Primitive=1, hash="22de6c88dab2f4ec") -> Tensor[(1, 3136, 1), float32] {
    variance(%p0227, %p1168, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %589 = %588(%585, %587) /* ty=Tensor[(1, 3136, 1), float32] */;
  %590 = fn (%p0204: Tensor[(1, 3136, 96), float32], %p1155: Tensor[(1, 3136, 1), float32], %p255: Tensor[(1, 3136, 1), float32], %p331: Tensor[(96), float32], %p431: Tensor[(96), float32], Primitive=1, hash="f7f0533f973ca499") -> Tensor[(3136, 96), float32] {
    %506 = add(%p255, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 3136, 1), float32] */;
    %507 = subtract(%p0204, %p1155) /* ty=Tensor[(1, 3136, 96), float32] */;
    %508 = sqrt(%506) /* ty=Tensor[(1, 3136, 1), float32] */;
    %509 = divide(%507, %508) /* ty=Tensor[(1, 3136, 96), float32] */;
    %510 = multiply(%509, %p331) /* ty=Tensor[(1, 3136, 96), float32] */;
    %511 = add(%510, %p431) /* ty=Tensor[(1, 3136, 96), float32] */;
    reshape(%511, newshape=[-1, 96]) /* ty=Tensor[(3136, 96), float32] */
  };
  %591 = %590(%585, %587, %589, meta[relay.Constant][11] /* ty=Tensor[(96), float32] */, meta[relay.Constant][12] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(3136, 96), float32] */;
  %592 = fn (%p0203: Tensor[(3136, 96), float32], %p1154: Tensor[(384, 96), float32], Primitive=1, hash="e0a103361eddf025") -> Tensor[(3136, 384), float32] {
    nn.dense(%p0203, %p1154, units=None) /* ty=Tensor[(3136, 384), float32] */
  };
  %593 = %592(%591, meta[relay.Constant][13] /* ty=Tensor[(384, 96), float32] */) /* ty=Tensor[(3136, 384), float32] */;
  %594 = fn (%p0202: Tensor[(3136, 384), float32], %p1153: Tensor[(384), float32], Primitive=1, hash="a7e3757a3fe9a71d") -> Tensor[(3136, 384), float32] {
    %499 = reshape(%p0202, newshape=[1, 3136, 384]) /* ty=Tensor[(1, 3136, 384), float32] */;
    %500 = add(%499, %p1153) /* ty=Tensor[(1, 3136, 384), float32] */;
    %501 = multiply(%500, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 3136, 384), float32] */;
    %502 = erf(%501) /* ty=Tensor[(1, 3136, 384), float32] */;
    %503 = multiply(%502, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 3136, 384), float32] */;
    %504 = add(0.5f /* ty=float32 */, %503) /* ty=Tensor[(1, 3136, 384), float32] */;
    %505 = multiply(%500, %504) /* ty=Tensor[(1, 3136, 384), float32] */;
    reshape(%505, newshape=[-1, 384]) /* ty=Tensor[(3136, 384), float32] */
  };
  %595 = %594(%593, meta[relay.Constant][14] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(3136, 384), float32] */;
  %596 = fn (%p0201: Tensor[(3136, 384), float32], %p1152: Tensor[(96, 384), float32], Primitive=1, hash="8e4913e63f576170") -> Tensor[(3136, 96), float32] {
    nn.dense(%p0201, %p1152, units=None) /* ty=Tensor[(3136, 96), float32] */
  };
  %597 = %596(%595, meta[relay.Constant][15] /* ty=Tensor[(96, 384), float32] */) /* ty=Tensor[(3136, 96), float32] */;
  %598 = fn (%p0200: Tensor[(3136, 96), float32], %p1151: Tensor[(96), float32], %p254: Tensor[(1, 3136, 96), float32], Primitive=1, hash="fde53751fa61ce66") -> Tensor[(1, 3136, 96), float32] {
    %497 = reshape(%p0200, newshape=[1, 3136, 96]) /* ty=Tensor[(1, 3136, 96), float32] */;
    %498 = add(%497, %p1151) /* ty=Tensor[(1, 3136, 96), float32] */;
    add(%p254, %498) /* ty=Tensor[(1, 3136, 96), float32] */
  };
  %599 = %598(%597, meta[relay.Constant][16] /* ty=Tensor[(96), float32] */, %585) /* ty=Tensor[(1, 3136, 96), float32] */;
  %600 = fn (%p0228: Tensor[(1, 3136, 96), float32], Primitive=1, hash="cd5fdf7b59629fe1") -> Tensor[(1, 3136, 1), float32] {
    mean(%p0228, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %601 = %600(%599) /* ty=Tensor[(1, 3136, 1), float32] */;
  %602 = fn (%p0229: Tensor[(1, 3136, 96), float32], %p1169: Tensor[(1, 3136, 1), float32], Primitive=1, hash="22de6c88dab2f4ec") -> Tensor[(1, 3136, 1), float32] {
    variance(%p0229, %p1169, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %603 = %602(%599, %601) /* ty=Tensor[(1, 3136, 1), float32] */;
  %604 = fn (%p0199: Tensor[(1, 3136, 96), float32], %p1150: Tensor[(1, 3136, 1), float32], %p253: Tensor[(1, 3136, 1), float32], %p330: Tensor[(96), float32], %p430: Tensor[(96), float32], %p54: Tensor[(1, 56, 56, 96), int64], %p64: Tensor[(1, 56, 56, 96), int64], Primitive=1, hash="a9ec8f9f69e7f63b") -> Tensor[(3136, 96), float32] {
    %486 = add(%p253, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 3136, 1), float32] */;
    %487 = subtract(%p0199, %p1150) /* ty=Tensor[(1, 3136, 96), float32] */;
    %488 = sqrt(%486) /* ty=Tensor[(1, 3136, 1), float32] */;
    %489 = divide(%487, %488) /* ty=Tensor[(1, 3136, 96), float32] */;
    %490 = multiply(%489, %p330) /* ty=Tensor[(1, 3136, 96), float32] */;
    %491 = add(%490, %p430) /* ty=Tensor[(1, 3136, 96), float32] */;
    %492 = reshape(%491, newshape=[1, 56, 56, 96]) /* ty=Tensor[(1, 56, 56, 96), float32] */;
    %493 = gather(%492, %p54, axis=1) /* ty=Tensor[(1, 56, 56, 96), float32] */;
    %494 = gather(%493, %p64, axis=2) /* ty=Tensor[(1, 56, 56, 96), float32] */;
    %495 = reshape(%494, newshape=[1, 8, 7, 8, 7, 96]) /* ty=Tensor[(1, 8, 7, 8, 7, 96), float32] */;
    %496 = transpose(%495, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 8, 8, 7, 7, 96), float32] */;
    reshape(%496, newshape=[3136, 96]) /* ty=Tensor[(3136, 96), float32] */
  };
  %605 = %604(%599, %601, %603, meta[relay.Constant][17] /* ty=Tensor[(96), float32] */, meta[relay.Constant][18] /* ty=Tensor[(96), float32] */, meta[relay.Constant][19] /* ty=Tensor[(1, 56, 56, 96), int64] */, meta[relay.Constant][20] /* ty=Tensor[(1, 56, 56, 96), int64] */) /* ty=Tensor[(3136, 96), float32] */;
  %606 = fn (%p0198: Tensor[(3136, 96), float32], %p1149: Tensor[(288, 96), float32], Primitive=1, hash="303f96ca60311351") -> Tensor[(3136, 288), float32] {
    nn.dense(%p0198, %p1149, units=None) /* ty=Tensor[(3136, 288), float32] */
  };
  %607 = %606(%605, meta[relay.Constant][21] /* ty=Tensor[(288, 96), float32] */) /* ty=Tensor[(3136, 288), float32] */;
  %608 = fn (%p0197: Tensor[(3136, 288), float32], %p1148: Tensor[(288), float32], Primitive=1, hash="596d116b00403ebb") -> Tensor[(3, 64, 3, 49, 32), float32] {
    %483 = reshape(%p0197, newshape=[64, 49, 288]) /* ty=Tensor[(64, 49, 288), float32] */;
    %484 = add(%483, %p1148) /* ty=Tensor[(64, 49, 288), float32] */;
    %485 = reshape(%484, newshape=[64, 49, 3, 3, 32]) /* ty=Tensor[(64, 49, 3, 3, 32), float32] */;
    transpose(%485, axes=[2, 0, 3, 1, 4]) /* ty=Tensor[(3, 64, 3, 49, 32), float32] */
  };
  %609 = %608(%607, meta[relay.Constant][22] /* ty=Tensor[(288), float32] */) /* ty=Tensor[(3, 64, 3, 49, 32), float32] */;
  %610 = fn (%p0196: Tensor[(3, 64, 3, 49, 32), float32], Primitive=1, hash="b9c05eb76c1cdf31") -> Tensor[(192, 49, 32), float32] {
    %481 = take(%p0196, 0 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(64, 3, 49, 32), float32] */;
    %482 = multiply(%481, 0.176777f /* ty=float32 */) /* ty=Tensor[(64, 3, 49, 32), float32] */;
    reshape(%482, newshape=[-1, 49, 32]) /* ty=Tensor[(192, 49, 32), float32] */
  };
  %612 = fn (%p0230: Tensor[(3, 64, 3, 49, 32), float32], Primitive=1, hash="e81bba9fb411f52e") -> Tensor[(192, 49, 32), float32] {
    %611 = take(%p0230, 1 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(64, 3, 49, 32), float32] */;
    reshape(%611, newshape=[-1, 49, 32]) /* ty=Tensor[(192, 49, 32), float32] */
  };
  %613 = %610(%609) /* ty=Tensor[(192, 49, 32), float32] */;
  %614 = %612(%609) /* ty=Tensor[(192, 49, 32), float32] */;
  %615 = fn (%p0195: Tensor[(192, 49, 32), float32], %p1147: Tensor[(192, 49, 32), float32], Primitive=1, hash="2e83155f40aa0499") -> Tensor[(192, 49, 49), float32] {
    nn.batch_matmul(%p0195, %p1147, transpose_b=True) /* ty=Tensor[(192, 49, 49), float32] */
  };
  %616 = %615(%613, %614) /* ty=Tensor[(192, 49, 49), float32] */;
  %617 = fn (%p0194: Tensor[(192, 49, 49), float32], %p1146: Tensor[(1, 3, 49, 49), float32], %p252: Tensor[(1, 64, 1, 49, 49), float32], Primitive=1, hash="b7b4a2e898f75259") -> Tensor[(64, 3, 49, 49), float32] {
    %477 = reshape(%p0194, newshape=[64, 3, 49, 49]) /* ty=Tensor[(64, 3, 49, 49), float32] */;
    %478 = add(%477, %p1146) /* ty=Tensor[(64, 3, 49, 49), float32] */;
    %479 = reshape(%478, newshape=[1, 64, 3, 49, 49]) /* ty=Tensor[(1, 64, 3, 49, 49), float32] */;
    %480 = add(%479, %p252) /* ty=Tensor[(1, 64, 3, 49, 49), float32] */;
    reshape(%480, newshape=[-1, 3, 49, 49]) /* ty=Tensor[(64, 3, 49, 49), float32] */
  };
  %618 = %617(%616, meta[relay.Constant][23] /* ty=Tensor[(1, 3, 49, 49), float32] */, meta[relay.Constant][24] /* ty=Tensor[(1, 64, 1, 49, 49), float32] */) /* ty=Tensor[(64, 3, 49, 49), float32] */;
  %619 = fn (%p0193: Tensor[(64, 3, 49, 49), float32], Primitive=1, hash="5c4ac934ea983b37") -> Tensor[(64, 3, 49, 49), float32] {
    nn.softmax(%p0193) /* ty=Tensor[(64, 3, 49, 49), float32] */
  };
  %620 = %619(%618) /* ty=Tensor[(64, 3, 49, 49), float32] */;
  %621 = fn (%p0192: Tensor[(64, 3, 49, 49), float32], Primitive=1, relay.reshape_only=1, hash="b8ac7d2e67dede13") -> Tensor[(192, 49, 49), float32] {
    reshape(%p0192, newshape=[-1, 49, 49]) /* ty=Tensor[(192, 49, 49), float32] */
  };
  %624 = fn (%p0231: Tensor[(3, 64, 3, 49, 32), float32], Primitive=1, hash="568931d7bdbd42d8") -> Tensor[(192, 32, 49), float32] {
    %622 = take(%p0231, 2 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(64, 3, 49, 32), float32] */;
    %623 = transpose(%622, axes=[0, 1, 3, 2]) /* ty=Tensor[(64, 3, 32, 49), float32] */;
    reshape(%623, newshape=[-1, 32, 49]) /* ty=Tensor[(192, 32, 49), float32] */
  };
  %625 = %621(%620) /* ty=Tensor[(192, 49, 49), float32] */;
  %626 = %624(%609) /* ty=Tensor[(192, 32, 49), float32] */;
  %627 = fn (%p0191: Tensor[(192, 49, 49), float32], %p1145: Tensor[(192, 32, 49), float32], Primitive=1, hash="bc3539683fba29aa") -> Tensor[(192, 49, 32), float32] {
    nn.batch_matmul(%p0191, %p1145, transpose_b=True) /* ty=Tensor[(192, 49, 32), float32] */
  };
  %628 = %627(%625, %626) /* ty=Tensor[(192, 49, 32), float32] */;
  %629 = fn (%p0190: Tensor[(192, 49, 32), float32], Primitive=1, hash="a0cbbaea1149ac3f") -> Tensor[(3136, 96), float32] {
    %475 = reshape(%p0190, newshape=[64, 3, 49, 32]) /* ty=Tensor[(64, 3, 49, 32), float32] */;
    %476 = transpose(%475, axes=[0, 2, 1, 3]) /* ty=Tensor[(64, 49, 3, 32), float32] */;
    reshape(%476, newshape=[3136, 96]) /* ty=Tensor[(3136, 96), float32] */
  };
  %630 = %629(%628) /* ty=Tensor[(3136, 96), float32] */;
  %631 = fn (%p0189: Tensor[(3136, 96), float32], %p1144: Tensor[(96, 96), float32], Primitive=1, hash="62e6d70f0d7057b6") -> Tensor[(3136, 96), float32] {
    nn.dense(%p0189, %p1144, units=None) /* ty=Tensor[(3136, 96), float32] */
  };
  %632 = %631(%630, meta[relay.Constant][25] /* ty=Tensor[(96, 96), float32] */) /* ty=Tensor[(3136, 96), float32] */;
  %633 = fn (%p0188: Tensor[(3136, 96), float32], %p1143: Tensor[(96), float32], %p251: Tensor[(1, 56, 56, 96), int64], %p329: Tensor[(1, 56, 56, 96), int64], %p429: Tensor[(1, 3136, 96), float32], Primitive=1, hash="2a7cb4c1eadbaba5") -> Tensor[(1, 3136, 96), float32] {
    %467 = reshape(%p0188, newshape=[64, 49, 96]) /* ty=Tensor[(64, 49, 96), float32] */;
    %468 = add(%467, %p1143) /* ty=Tensor[(64, 49, 96), float32] */;
    %469 = reshape(%468, newshape=[1, 8, 8, 7, 7, 96]) /* ty=Tensor[(1, 8, 8, 7, 7, 96), float32] */;
    %470 = transpose(%469, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 8, 7, 8, 7, 96), float32] */;
    %471 = reshape(%470, newshape=[1, 56, 56, -1]) /* ty=Tensor[(1, 56, 56, 96), float32] */;
    %472 = gather(%471, %p251, axis=1) /* ty=Tensor[(1, 56, 56, 96), float32] */;
    %473 = gather(%472, %p329, axis=2) /* ty=Tensor[(1, 56, 56, 96), float32] */;
    %474 = reshape(%473, newshape=[1, 3136, 96]) /* ty=Tensor[(1, 3136, 96), float32] */;
    add(%p429, %474) /* ty=Tensor[(1, 3136, 96), float32] */
  };
  %634 = %633(%632, meta[relay.Constant][26] /* ty=Tensor[(96), float32] */, meta[relay.Constant][27] /* ty=Tensor[(1, 56, 56, 96), int64] */, meta[relay.Constant][28] /* ty=Tensor[(1, 56, 56, 96), int64] */, %599) /* ty=Tensor[(1, 3136, 96), float32] */;
  %635 = fn (%p0232: Tensor[(1, 3136, 96), float32], Primitive=1, hash="cd5fdf7b59629fe1") -> Tensor[(1, 3136, 1), float32] {
    mean(%p0232, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %636 = %635(%634) /* ty=Tensor[(1, 3136, 1), float32] */;
  %637 = fn (%p0233: Tensor[(1, 3136, 96), float32], %p1170: Tensor[(1, 3136, 1), float32], Primitive=1, hash="22de6c88dab2f4ec") -> Tensor[(1, 3136, 1), float32] {
    variance(%p0233, %p1170, axis=[-1], keepdims=True) /* ty=Tensor[(1, 3136, 1), float32] */
  };
  %638 = %637(%634, %636) /* ty=Tensor[(1, 3136, 1), float32] */;
  %639 = fn (%p0187: Tensor[(1, 3136, 96), float32], %p1142: Tensor[(1, 3136, 1), float32], %p250: Tensor[(1, 3136, 1), float32], %p328: Tensor[(96), float32], %p428: Tensor[(96), float32], Primitive=1, hash="f7f0533f973ca499") -> Tensor[(3136, 96), float32] {
    %461 = add(%p250, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 3136, 1), float32] */;
    %462 = subtract(%p0187, %p1142) /* ty=Tensor[(1, 3136, 96), float32] */;
    %463 = sqrt(%461) /* ty=Tensor[(1, 3136, 1), float32] */;
    %464 = divide(%462, %463) /* ty=Tensor[(1, 3136, 96), float32] */;
    %465 = multiply(%464, %p328) /* ty=Tensor[(1, 3136, 96), float32] */;
    %466 = add(%465, %p428) /* ty=Tensor[(1, 3136, 96), float32] */;
    reshape(%466, newshape=[-1, 96]) /* ty=Tensor[(3136, 96), float32] */
  };
  %640 = %639(%634, %636, %638, meta[relay.Constant][29] /* ty=Tensor[(96), float32] */, meta[relay.Constant][30] /* ty=Tensor[(96), float32] */) /* ty=Tensor[(3136, 96), float32] */;
  %641 = fn (%p0186: Tensor[(3136, 96), float32], %p1141: Tensor[(384, 96), float32], Primitive=1, hash="e0a103361eddf025") -> Tensor[(3136, 384), float32] {
    nn.dense(%p0186, %p1141, units=None) /* ty=Tensor[(3136, 384), float32] */
  };
  %642 = %641(%640, meta[relay.Constant][31] /* ty=Tensor[(384, 96), float32] */) /* ty=Tensor[(3136, 384), float32] */;
  %643 = fn (%p0185: Tensor[(3136, 384), float32], %p1140: Tensor[(384), float32], Primitive=1, hash="a7e3757a3fe9a71d") -> Tensor[(3136, 384), float32] {
    %454 = reshape(%p0185, newshape=[1, 3136, 384]) /* ty=Tensor[(1, 3136, 384), float32] */;
    %455 = add(%454, %p1140) /* ty=Tensor[(1, 3136, 384), float32] */;
    %456 = multiply(%455, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 3136, 384), float32] */;
    %457 = erf(%456) /* ty=Tensor[(1, 3136, 384), float32] */;
    %458 = multiply(%457, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 3136, 384), float32] */;
    %459 = add(0.5f /* ty=float32 */, %458) /* ty=Tensor[(1, 3136, 384), float32] */;
    %460 = multiply(%455, %459) /* ty=Tensor[(1, 3136, 384), float32] */;
    reshape(%460, newshape=[-1, 384]) /* ty=Tensor[(3136, 384), float32] */
  };
  %644 = %643(%642, meta[relay.Constant][32] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(3136, 384), float32] */;
  %645 = fn (%p0184: Tensor[(3136, 384), float32], %p1139: Tensor[(96, 384), float32], Primitive=1, hash="8e4913e63f576170") -> Tensor[(3136, 96), float32] {
    nn.dense(%p0184, %p1139, units=None) /* ty=Tensor[(3136, 96), float32] */
  };
  %646 = %645(%644, meta[relay.Constant][33] /* ty=Tensor[(96, 384), float32] */) /* ty=Tensor[(3136, 96), float32] */;
  %647 = fn (%p0183: Tensor[(3136, 96), float32], %p1138: Tensor[(96), float32], %p249: Tensor[(1, 3136, 96), float32], Primitive=1, hash="b9728f216a13ead2") -> Tensor[(1, 784, 384), float32] {
    %442 = reshape(%p0183, newshape=[1, 3136, 96]) /* ty=Tensor[(1, 3136, 96), float32] */;
    %443 = add(%442, %p1138) /* ty=Tensor[(1, 3136, 96), float32] */;
    %444 = add(%p249, %443) /* ty=Tensor[(1, 3136, 96), float32] */;
    %445 = reshape(%444, newshape=[1, 56, 56, 96]) /* ty=Tensor[(1, 56, 56, 96), float32] */;
    %446 = strided_slice(%445, begin=[0, 0, 0, 0], end=[1, 56, 56, 96], strides=[1, 2, 1, 1], axes=None) /* ty=Tensor[(1, 28, 56, 96), float32] */;
    %447 = strided_slice(%445, begin=[0, 1, 0, 0], end=[1, 56, 56, 96], strides=[1, 2, 1, 1], axes=None) /* ty=Tensor[(1, 28, 56, 96), float32] */;
    %448 = strided_slice(%446, begin=[0, 0, 0, 0], end=[1, 28, 56, 96], strides=[1, 1, 2, 1], axes=None) /* ty=Tensor[(1, 28, 28, 96), float32] */;
    %449 = strided_slice(%447, begin=[0, 0, 0, 0], end=[1, 28, 56, 96], strides=[1, 1, 2, 1], axes=None) /* ty=Tensor[(1, 28, 28, 96), float32] */;
    %450 = strided_slice(%446, begin=[0, 0, 1, 0], end=[1, 28, 56, 96], strides=[1, 1, 2, 1], axes=None) /* ty=Tensor[(1, 28, 28, 96), float32] */;
    %451 = strided_slice(%447, begin=[0, 0, 1, 0], end=[1, 28, 56, 96], strides=[1, 1, 2, 1], axes=None) /* ty=Tensor[(1, 28, 28, 96), float32] */;
    %452 = (%448, %449, %450, %451);
    %453 = concatenate(%452, axis=-1) /* ty=Tensor[(1, 28, 28, 384), float32] */;
    reshape(%453, newshape=[1, -1, 384]) /* ty=Tensor[(1, 784, 384), float32] */
  };
  %648 = %647(%646, meta[relay.Constant][34] /* ty=Tensor[(96), float32] */, %634) /* ty=Tensor[(1, 784, 384), float32] */;
  %649 = fn (%p0234: Tensor[(1, 784, 384), float32], Primitive=1, hash="52118fa9aa80455e") -> Tensor[(1, 784, 1), float32] {
    mean(%p0234, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %650 = %649(%648) /* ty=Tensor[(1, 784, 1), float32] */;
  %651 = fn (%p0235: Tensor[(1, 784, 384), float32], %p1171: Tensor[(1, 784, 1), float32], Primitive=1, hash="7cf9f73fba2de7c7") -> Tensor[(1, 784, 1), float32] {
    variance(%p0235, %p1171, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %652 = %651(%648, %650) /* ty=Tensor[(1, 784, 1), float32] */;
  %653 = fn (%p0182: Tensor[(1, 784, 384), float32], %p1137: Tensor[(1, 784, 1), float32], %p248: Tensor[(1, 784, 1), float32], %p327: Tensor[(384), float32], %p427: Tensor[(384), float32], Primitive=1, hash="90e6db895670c790") -> Tensor[(784, 384), float32] {
    %436 = add(%p248, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 784, 1), float32] */;
    %437 = subtract(%p0182, %p1137) /* ty=Tensor[(1, 784, 384), float32] */;
    %438 = sqrt(%436) /* ty=Tensor[(1, 784, 1), float32] */;
    %439 = divide(%437, %438) /* ty=Tensor[(1, 784, 384), float32] */;
    %440 = multiply(%439, %p327) /* ty=Tensor[(1, 784, 384), float32] */;
    %441 = add(%440, %p427) /* ty=Tensor[(1, 784, 384), float32] */;
    reshape(%441, newshape=[-1, 384]) /* ty=Tensor[(784, 384), float32] */
  };
  %654 = %653(%648, %650, %652, meta[relay.Constant][35] /* ty=Tensor[(384), float32] */, meta[relay.Constant][36] /* ty=Tensor[(384), float32] */) /* ty=Tensor[(784, 384), float32] */;
  %655 = fn (%p0181: Tensor[(784, 384), float32], %p1136: Tensor[(192, 384), float32], Primitive=1, hash="401fc3114781472e") -> Tensor[(784, 192), float32] {
    nn.dense(%p0181, %p1136, units=None) /* ty=Tensor[(784, 192), float32] */
  };
  %656 = %655(%654, meta[relay.Constant][37] /* ty=Tensor[(192, 384), float32] */) /* ty=Tensor[(784, 192), float32] */;
  %657 = fn (%p0180: Tensor[(784, 192), float32], Primitive=1, relay.reshape_only=1, hash="1bb3edbe2fd2eef3") -> Tensor[(1, 784, 192), float32] {
    reshape(%p0180, newshape=[1, 784, 192]) /* ty=Tensor[(1, 784, 192), float32] */
  };
  %658 = %657(%656) /* ty=Tensor[(1, 784, 192), float32] */;
  %659 = fn (%p0236: Tensor[(1, 784, 192), float32], Primitive=1, hash="1d45326e7f287f68") -> Tensor[(1, 784, 1), float32] {
    mean(%p0236, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %660 = %659(%658) /* ty=Tensor[(1, 784, 1), float32] */;
  %661 = fn (%p0237: Tensor[(1, 784, 192), float32], %p1172: Tensor[(1, 784, 1), float32], Primitive=1, hash="ebe164fd1b7d1e8d") -> Tensor[(1, 784, 1), float32] {
    variance(%p0237, %p1172, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %662 = %661(%658, %660) /* ty=Tensor[(1, 784, 1), float32] */;
  %663 = fn (%p0179: Tensor[(1, 784, 192), float32], %p1135: Tensor[(1, 784, 1), float32], %p247: Tensor[(1, 784, 1), float32], %p326: Tensor[(192), float32], %p426: Tensor[(192), float32], Primitive=1, hash="92ac40fa7710bbe0") -> Tensor[(784, 192), float32] {
    %428 = add(%p247, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 784, 1), float32] */;
    %429 = subtract(%p0179, %p1135) /* ty=Tensor[(1, 784, 192), float32] */;
    %430 = sqrt(%428) /* ty=Tensor[(1, 784, 1), float32] */;
    %431 = divide(%429, %430) /* ty=Tensor[(1, 784, 192), float32] */;
    %432 = multiply(%431, %p326) /* ty=Tensor[(1, 784, 192), float32] */;
    %433 = add(%432, %p426) /* ty=Tensor[(1, 784, 192), float32] */;
    %434 = reshape(%433, newshape=[1, 4, 7, 4, 7, 192]) /* ty=Tensor[(1, 4, 7, 4, 7, 192), float32] */;
    %435 = transpose(%434, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 4, 4, 7, 7, 192), float32] */;
    reshape(%435, newshape=[784, 192]) /* ty=Tensor[(784, 192), float32] */
  };
  %664 = %663(%658, %660, %662, meta[relay.Constant][38] /* ty=Tensor[(192), float32] */, meta[relay.Constant][39] /* ty=Tensor[(192), float32] */) /* ty=Tensor[(784, 192), float32] */;
  %665 = fn (%p0178: Tensor[(784, 192), float32], %p1134: Tensor[(576, 192), float32], Primitive=1, hash="0214735801a24de4") -> Tensor[(784, 576), float32] {
    nn.dense(%p0178, %p1134, units=None) /* ty=Tensor[(784, 576), float32] */
  };
  %666 = %665(%664, meta[relay.Constant][40] /* ty=Tensor[(576, 192), float32] */) /* ty=Tensor[(784, 576), float32] */;
  %667 = fn (%p0177: Tensor[(784, 576), float32], %p1133: Tensor[(576), float32], Primitive=1, hash="072be4fcf6b61d73") -> Tensor[(3, 16, 6, 49, 32), float32] {
    %425 = reshape(%p0177, newshape=[16, 49, 576]) /* ty=Tensor[(16, 49, 576), float32] */;
    %426 = add(%425, %p1133) /* ty=Tensor[(16, 49, 576), float32] */;
    %427 = reshape(%426, newshape=[16, 49, 3, 6, 32]) /* ty=Tensor[(16, 49, 3, 6, 32), float32] */;
    transpose(%427, axes=[2, 0, 3, 1, 4]) /* ty=Tensor[(3, 16, 6, 49, 32), float32] */
  };
  %668 = %667(%666, meta[relay.Constant][41] /* ty=Tensor[(576), float32] */) /* ty=Tensor[(3, 16, 6, 49, 32), float32] */;
  %669 = fn (%p0176: Tensor[(3, 16, 6, 49, 32), float32], Primitive=1, hash="1c91548504ecd717") -> Tensor[(96, 49, 32), float32] {
    %423 = take(%p0176, 0 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(16, 6, 49, 32), float32] */;
    %424 = multiply(%423, 0.176777f /* ty=float32 */) /* ty=Tensor[(16, 6, 49, 32), float32] */;
    reshape(%424, newshape=[-1, 49, 32]) /* ty=Tensor[(96, 49, 32), float32] */
  };
  %671 = fn (%p0238: Tensor[(3, 16, 6, 49, 32), float32], Primitive=1, hash="87e40f058084eca8") -> Tensor[(96, 49, 32), float32] {
    %670 = take(%p0238, 1 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(16, 6, 49, 32), float32] */;
    reshape(%670, newshape=[-1, 49, 32]) /* ty=Tensor[(96, 49, 32), float32] */
  };
  %672 = %669(%668) /* ty=Tensor[(96, 49, 32), float32] */;
  %673 = %671(%668) /* ty=Tensor[(96, 49, 32), float32] */;
  %674 = fn (%p0175: Tensor[(96, 49, 32), float32], %p1132: Tensor[(96, 49, 32), float32], Primitive=1, hash="2dd16fcd9f0e314f") -> Tensor[(96, 49, 49), float32] {
    nn.batch_matmul(%p0175, %p1132, transpose_b=True) /* ty=Tensor[(96, 49, 49), float32] */
  };
  %675 = %674(%672, %673) /* ty=Tensor[(96, 49, 49), float32] */;
  %676 = fn (%p0174: Tensor[(96, 49, 49), float32], %p1131: Tensor[(1, 6, 49, 49), float32], Primitive=1, hash="660a394f1acb2cc5") -> Tensor[(16, 6, 49, 49), float32] {
    %422 = reshape(%p0174, newshape=[16, 6, 49, 49]) /* ty=Tensor[(16, 6, 49, 49), float32] */;
    add(%422, %p1131) /* ty=Tensor[(16, 6, 49, 49), float32] */
  };
  %677 = %676(%675, meta[relay.Constant][42] /* ty=Tensor[(1, 6, 49, 49), float32] */) /* ty=Tensor[(16, 6, 49, 49), float32] */;
  %678 = fn (%p0173: Tensor[(16, 6, 49, 49), float32], Primitive=1, hash="61bb497e6d99959d") -> Tensor[(16, 6, 49, 49), float32] {
    nn.softmax(%p0173) /* ty=Tensor[(16, 6, 49, 49), float32] */
  };
  %679 = %678(%677) /* ty=Tensor[(16, 6, 49, 49), float32] */;
  %680 = fn (%p0172: Tensor[(16, 6, 49, 49), float32], Primitive=1, relay.reshape_only=1, hash="eb4527024c19affb") -> Tensor[(96, 49, 49), float32] {
    reshape(%p0172, newshape=[-1, 49, 49]) /* ty=Tensor[(96, 49, 49), float32] */
  };
  %683 = fn (%p0239: Tensor[(3, 16, 6, 49, 32), float32], Primitive=1, hash="034045ae0e6be3f3") -> Tensor[(96, 32, 49), float32] {
    %681 = take(%p0239, 2 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(16, 6, 49, 32), float32] */;
    %682 = transpose(%681, axes=[0, 1, 3, 2]) /* ty=Tensor[(16, 6, 32, 49), float32] */;
    reshape(%682, newshape=[-1, 32, 49]) /* ty=Tensor[(96, 32, 49), float32] */
  };
  %684 = %680(%679) /* ty=Tensor[(96, 49, 49), float32] */;
  %685 = %683(%668) /* ty=Tensor[(96, 32, 49), float32] */;
  %686 = fn (%p0171: Tensor[(96, 49, 49), float32], %p1130: Tensor[(96, 32, 49), float32], Primitive=1, hash="28840ef4470cc864") -> Tensor[(96, 49, 32), float32] {
    nn.batch_matmul(%p0171, %p1130, transpose_b=True) /* ty=Tensor[(96, 49, 32), float32] */
  };
  %687 = %686(%684, %685) /* ty=Tensor[(96, 49, 32), float32] */;
  %688 = fn (%p0170: Tensor[(96, 49, 32), float32], Primitive=1, hash="c3ed4a10b82ee90c") -> Tensor[(784, 192), float32] {
    %420 = reshape(%p0170, newshape=[16, 6, 49, 32]) /* ty=Tensor[(16, 6, 49, 32), float32] */;
    %421 = transpose(%420, axes=[0, 2, 1, 3]) /* ty=Tensor[(16, 49, 6, 32), float32] */;
    reshape(%421, newshape=[784, 192]) /* ty=Tensor[(784, 192), float32] */
  };
  %689 = %688(%687) /* ty=Tensor[(784, 192), float32] */;
  %690 = fn (%p0169: Tensor[(784, 192), float32], %p1129: Tensor[(192, 192), float32], Primitive=1, hash="409710bae3d5734d") -> Tensor[(784, 192), float32] {
    nn.dense(%p0169, %p1129, units=None) /* ty=Tensor[(784, 192), float32] */
  };
  %691 = %690(%689, meta[relay.Constant][43] /* ty=Tensor[(192, 192), float32] */) /* ty=Tensor[(784, 192), float32] */;
  %692 = fn (%p0168: Tensor[(784, 192), float32], %p1128: Tensor[(192), float32], %p246: Tensor[(1, 784, 192), float32], Primitive=1, hash="69f7aa6fe4ecd623") -> Tensor[(1, 784, 192), float32] {
    %415 = reshape(%p0168, newshape=[16, 49, 192]) /* ty=Tensor[(16, 49, 192), float32] */;
    %416 = add(%415, %p1128) /* ty=Tensor[(16, 49, 192), float32] */;
    %417 = reshape(%416, newshape=[1, 4, 4, 7, 7, 192]) /* ty=Tensor[(1, 4, 4, 7, 7, 192), float32] */;
    %418 = transpose(%417, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 4, 7, 4, 7, 192), float32] */;
    %419 = reshape(%418, newshape=[1, 784, 192]) /* ty=Tensor[(1, 784, 192), float32] */;
    add(%p246, %419) /* ty=Tensor[(1, 784, 192), float32] */
  };
  %693 = %692(%691, meta[relay.Constant][44] /* ty=Tensor[(192), float32] */, %658) /* ty=Tensor[(1, 784, 192), float32] */;
  %694 = fn (%p0240: Tensor[(1, 784, 192), float32], Primitive=1, hash="1d45326e7f287f68") -> Tensor[(1, 784, 1), float32] {
    mean(%p0240, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %695 = %694(%693) /* ty=Tensor[(1, 784, 1), float32] */;
  %696 = fn (%p0241: Tensor[(1, 784, 192), float32], %p1173: Tensor[(1, 784, 1), float32], Primitive=1, hash="ebe164fd1b7d1e8d") -> Tensor[(1, 784, 1), float32] {
    variance(%p0241, %p1173, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %697 = %696(%693, %695) /* ty=Tensor[(1, 784, 1), float32] */;
  %698 = fn (%p0167: Tensor[(1, 784, 192), float32], %p1127: Tensor[(1, 784, 1), float32], %p245: Tensor[(1, 784, 1), float32], %p325: Tensor[(192), float32], %p425: Tensor[(192), float32], Primitive=1, hash="708b447a8f5380c4") -> Tensor[(784, 192), float32] {
    %409 = add(%p245, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 784, 1), float32] */;
    %410 = subtract(%p0167, %p1127) /* ty=Tensor[(1, 784, 192), float32] */;
    %411 = sqrt(%409) /* ty=Tensor[(1, 784, 1), float32] */;
    %412 = divide(%410, %411) /* ty=Tensor[(1, 784, 192), float32] */;
    %413 = multiply(%412, %p325) /* ty=Tensor[(1, 784, 192), float32] */;
    %414 = add(%413, %p425) /* ty=Tensor[(1, 784, 192), float32] */;
    reshape(%414, newshape=[-1, 192]) /* ty=Tensor[(784, 192), float32] */
  };
  %699 = %698(%693, %695, %697, meta[relay.Constant][45] /* ty=Tensor[(192), float32] */, meta[relay.Constant][46] /* ty=Tensor[(192), float32] */) /* ty=Tensor[(784, 192), float32] */;
  %700 = fn (%p0166: Tensor[(784, 192), float32], %p1126: Tensor[(768, 192), float32], Primitive=1, hash="68696b21ee4a52fc") -> Tensor[(784, 768), float32] {
    nn.dense(%p0166, %p1126, units=None) /* ty=Tensor[(784, 768), float32] */
  };
  %701 = %700(%699, meta[relay.Constant][47] /* ty=Tensor[(768, 192), float32] */) /* ty=Tensor[(784, 768), float32] */;
  %702 = fn (%p0165: Tensor[(784, 768), float32], %p1125: Tensor[(768), float32], Primitive=1, hash="e6c61975f9265f7b") -> Tensor[(784, 768), float32] {
    %402 = reshape(%p0165, newshape=[1, 784, 768]) /* ty=Tensor[(1, 784, 768), float32] */;
    %403 = add(%402, %p1125) /* ty=Tensor[(1, 784, 768), float32] */;
    %404 = multiply(%403, 0.707107f /* ty=float32 */) /* ty=Tensor[(1, 784, 768), float32] */;
    %405 = erf(%404) /* ty=Tensor[(1, 784, 768), float32] */;
    %406 = multiply(%405, 0.5f /* ty=float32 */) /* ty=Tensor[(1, 784, 768), float32] */;
    %407 = add(0.5f /* ty=float32 */, %406) /* ty=Tensor[(1, 784, 768), float32] */;
    %408 = multiply(%403, %407) /* ty=Tensor[(1, 784, 768), float32] */;
    reshape(%408, newshape=[-1, 768]) /* ty=Tensor[(784, 768), float32] */
  };
  %703 = %702(%701, meta[relay.Constant][48] /* ty=Tensor[(768), float32] */) /* ty=Tensor[(784, 768), float32] */;
  %704 = fn (%p0164: Tensor[(784, 768), float32], %p1124: Tensor[(192, 768), float32], Primitive=1, hash="213cb1bc96b8a869") -> Tensor[(784, 192), float32] {
    nn.dense(%p0164, %p1124, units=None) /* ty=Tensor[(784, 192), float32] */
  };
  %705 = %704(%703, meta[relay.Constant][49] /* ty=Tensor[(192, 768), float32] */) /* ty=Tensor[(784, 192), float32] */;
  %706 = fn (%p0163: Tensor[(784, 192), float32], %p1123: Tensor[(192), float32], %p244: Tensor[(1, 784, 192), float32], Primitive=1, hash="cd7d882e34bf0d78") -> Tensor[(1, 784, 192), float32] {
    %400 = reshape(%p0163, newshape=[1, 784, 192]) /* ty=Tensor[(1, 784, 192), float32] */;
    %401 = add(%400, %p1123) /* ty=Tensor[(1, 784, 192), float32] */;
    add(%p244, %401) /* ty=Tensor[(1, 784, 192), float32] */
  };
  %707 = %706(%705, meta[relay.Constant][50] /* ty=Tensor[(192), float32] */, %693) /* ty=Tensor[(1, 784, 192), float32] */;
  %708 = fn (%p0242: Tensor[(1, 784, 192), float32], Primitive=1, hash="1d45326e7f287f68") -> Tensor[(1, 784, 1), float32] {
    mean(%p0242, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %709 = %708(%707) /* ty=Tensor[(1, 784, 1), float32] */;
  %710 = fn (%p0243: Tensor[(1, 784, 192), float32], %p1174: Tensor[(1, 784, 1), float32], Primitive=1, hash="ebe164fd1b7d1e8d") -> Tensor[(1, 784, 1), float32] {
    variance(%p0243, %p1174, axis=[-1], keepdims=True) /* ty=Tensor[(1, 784, 1), float32] */
  };
  %711 = %710(%707, %709) /* ty=Tensor[(1, 784, 1), float32] */;
  %712 = fn (%p0162: Tensor[(1, 784, 192), float32], %p1122: Tensor[(1, 784, 1), float32], %p243: Tensor[(1, 784, 1), float32], %p324: Tensor[(192), float32], %p424: Tensor[(192), float32], %p53: Tensor[(1, 28, 28, 192), int64], %p63: Tensor[(1, 28, 28, 192), int64], Primitive=1, hash="4dc0822603491769") -> Tensor[(784, 192), float32] {
    %389 = add(%p243, 1e-05f /* ty=float32 */) /* ty=Tensor[(1, 784, 1), float32] */;
    %390 = subtract(%p0162, %p1122) /* ty=Tensor[(1, 784, 192), float32] */;
    %391 = sqrt(%389) /* ty=Tensor[(1, 784, 1), float32] */;
    %392 = divide(%390, %391) /* ty=Tensor[(1, 784, 192), float32] */;
    %393 = multiply(%392, %p324) /* ty=Tensor[(1, 784, 192), float32] */;
    %394 = add(%393, %p424) /* ty=Tensor[(1, 784, 192), float32] */;
    %395 = reshape(%394, newshape=[1, 28, 28, 192]) /* ty=Tensor[(1, 28, 28, 192), float32] */;
    %396 = gather(%395, %p53, axis=1) /* ty=Tensor[(1, 28, 28, 192), float32] */;
    %397 = gather(%396, %p63, axis=2) /* ty=Tensor[(1, 28, 28, 192), float32] */;
    %398 = reshape(%397, newshape=[1, 4, 7, 4, 7, 192]) /* ty=Tensor[(1, 4, 7, 4, 7, 192), float32] */;
    %399 = transpose(%398, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 4, 4, 7, 7, 192), float32] */;
    reshape(%399, newshape=[784, 192]) /* ty=Tensor[(784, 192), float32] */
  };
  %713 = %712(%707, %709, %711, meta[relay.Constant][51] /* ty=Tensor[(192), float32] */, meta[relay.Constant][52] /* ty=Tensor[(192), float32] */, meta[relay.Constant][53] /* ty=Tensor[(1, 28, 28, 192), int64] */, meta[relay.Constant][54] /* ty=Tensor[(1, 28, 28, 192), int64] */) /* ty=Tensor[(784, 192), float32] */;
  %714 = fn (%p0161: Tensor[(784, 192), float32], %p1121: Tensor[(576, 192), float32], Primitive=1, hash="0214735801a24de4") -> Tensor[(784, 576), float32] {
    nn.dense(%p0161, %p1121, units=None) /* ty=Tensor[(784, 576), float32] */
  };
  %715 = %714(%713, meta[relay.Constant][55] /* ty=Tensor[(576, 192), float32] */) /* ty=Tensor[(784, 576), float32] */;
  %716 = fn (%p0160: Tensor[(784, 576), float32], %p1120: Tensor[(576), float32], Primitive=1, hash="072be4fcf6b61d73") -> Tensor[(3, 16, 6, 49, 32), float32] {
    %386 = reshape(%p0160, newshape=[16, 49, 576]) /* ty=Tensor[(16, 49, 576), float32] */;
    %387 = add(%386, %p1120) /* ty=Tensor[(16, 49, 576), float32] */;
    %388 = reshape(%387, newshape=[16, 49, 3, 6, 32]) /* ty=Tensor[(16, 49, 3, 6, 32), float32] */;
    transpose(%388, axes=[2, 0, 3, 1, 4]) /* ty=Tensor[(3, 16, 6, 49, 32), float32] */
  };
  %717 = %716(%715, meta[relay.Constant][56] /* ty=Tensor[(576), float32] */) /* ty=Tensor[(3, 16, 6, 49, 32), float32] */;
  %718 = fn (%p0159: Tensor[(3, 16, 6, 49, 32), float32], Primitive=1, hash="1c91548504ecd717") -> Tensor[(96, 49, 32), float32] {
    %384 = take(%p0159, 0 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(16, 6, 49, 32), float32] */;
    %385 = multiply(%384, 0.176777f /* ty=float32 */) /* ty=Tensor[(16, 6, 49, 32), float32] */;
    reshape(%385, newshape=[-1, 49, 32]) /* ty=Tensor[(96, 49, 32), float32] */
  };
  %720 = fn (%p0244: Tensor[(3, 16, 6, 49, 32), float32], Primitive=1, hash="87e40f058084eca8") -> Tensor[(96, 49, 32), float32] {
    %719 = take(%p0244, 1 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(16, 6, 49, 32), float32] */;
    reshape(%719, newshape=[-1, 49, 32]) /* ty=Tensor[(96, 49, 32), float32] */
  };
  %721 = %718(%717) /* ty=Tensor[(96, 49, 32), float32] */;
  %722 = %720(%717) /* ty=Tensor[(96, 49, 32), float32] */;
  %723 = fn (%p0158: Tensor[(96, 49, 32), float32], %p1119: Tensor[(96, 49, 32), float32], Primitive=1, hash="2dd16fcd9f0e314f") -> Tensor[(96, 49, 49), float32] {
    nn.batch_matmul(%p0158, %p1119, transpose_b=True) /* ty=Tensor[(96, 49, 49), float32] */
  };
  %724 = %723(%721, %722) /* ty=Tensor[(96, 49, 49), float32] */;
  %725 = fn (%p0157: Tensor[(96, 49, 49), float32], %p1118: Tensor[(1, 6, 49, 49), float32], %p242: Tensor[(1, 16, 1, 49, 49), float32], Primitive=1, hash="f67fe6a8ec5b4bda") -> Tensor[(16, 6, 49, 49), float32] {
    %380 = reshape(%p0157, newshape=[16, 6, 49, 49]) /* ty=Tensor[(16, 6, 49, 49), float32] */;
    %381 = add(%380, %p1118) /* ty=Tensor[(16, 6, 49, 49), float32] */;
    %382 = reshape(%381, newshape=[1, 16, 6, 49, 49]) /* ty=Tensor[(1, 16, 6, 49, 49), float32] */;
    %383 = add(%382, %p242) /* ty=Tensor[(1, 16, 6, 49, 49), float32] */;
    reshape(%383, newshape=[-1, 6, 49, 49]) /* ty=Tensor[(16, 6, 49, 49), float32] */
  };
  %726 = %725(%724, meta[relay.Constant][57] /* ty=Tensor[(1, 6, 49, 49), float32] */, meta[relay.Constant][58] /* ty=Tensor[(1, 16, 1, 49, 49), float32] */) /* ty=Tensor[(16, 6, 49, 49), float32] */;
  %727 = fn (%p0156: Tensor[(16, 6, 49, 49), float32], Primitive=1, hash="61bb497e6d99959d") -> Tensor[(16, 6, 49, 49), float32] {
    nn.softmax(%p0156) /* ty=Tensor[(16, 6, 49, 49), float32] */
  };
  %728 = %727(%726) /* ty=Tensor[(16, 6, 49, 49), float32] */;
  %729 = fn (%p0155: Tensor[(16, 6, 49, 49), float32], Primitive=1, relay.reshape_only=1, hash="eb4527024c19affb") -> Tensor[(96, 49, 49), float32] {
    reshape(%p0155, newshape=[-1, 49, 49]) /* ty=Tensor[(96, 49, 49), float32] */
  };
  %732 = fn (%p0245: Tensor[(3, 16, 6, 49, 32), float32], Primitive=1, hash="034045ae0e6be3f3") -> Tensor[(96, 32, 49), float32] {
    %730 = take(%p0245, 2 /* ty=int32 */, axis=0, mode="wrap") /* ty=Tensor[(16, 6, 49, 32), float32] */;
    %731 = transpose(%730, axes=[0, 1, 3, 2]) /* ty=Tensor[(16, 6, 32, 49), float32] */;
    reshape(%731, newshape=[-1, 32, 49]) /* ty=Tensor[(96, 32, 49), float32] */
  };
  %733 = %729(%728) /* ty=Tensor[(96, 49, 49), float32] */;
  %734 = %732(%717) /* ty=Tensor[(96, 32, 49), float32] */;
  %735 = fn (%p0154: Tensor[(96, 49, 49), float32], %p1117: Tensor[(96, 32, 49), float32], Primitive=1, hash="28840ef4470cc864") -> Tensor[(96, 49, 32), float32] {
    nn.batch_matmul(%p0154, %p1117, transpose_b=True) /* ty=Tensor[(96, 49, 32), float32] */
  };
  %736 = %735(%733, %734) /* ty=Tensor[(96, 49, 32), float32] */;
  %737 = fn (%p0153: Tensor[(96, 49, 32), float32], Primitive=1, hash="c3ed4a10b82ee90c") -> Tensor[(784, 192), float32] {
    %378 = reshape(%p0153, newshape=[16, 6, 49, 32]) /* ty=Tensor[(16, 6, 49, 32), float32] */;
    %379 = transpose(%378, axes=[0, 2, 1, 3]) /* ty=Tensor[(16, 49, 6, 32), float32] */;
    reshape(%379, newshape=[784, 192]) /* ty=Tensor[(784, 192), float32] */
  };
  %738 = %737(%736) /* ty=Tensor[(784, 192), float32] */;
  %739 = fn (%p0152: Tensor[(784, 192), float32], %p1116: Tensor[(192, 192), float32], Primitive=1, hash="409710bae3d5734d") -> Tensor[(784, 192), float32] {
    nn.dense(%p0152, %p1116, units=None) /* ty=Tensor[(784, 192), float32] */
  };
  %740 = %739(%738, meta[relay.Constant][59] /* ty=Tensor[(192, 192), float32] */) /* ty=Tensor[(784, 192), float32] */;
  %741 = fn (%p0151: Tensor[(784, 192), float32], %p1115: Tensor[(192), float32], %p241: Tensor[(1, 28, 28, 192), int64], %p323: Tensor[(1, 28, 28, 192), int64], %p423: Tensor[(1, 784, 192), float32], Primitive=1, hash="9d010a0acb89d334") -> Tensor[(1, 784, 192), float32] {
    %370 = reshape(%p0151, newshape=[16, 49, 192]) /* ty=Tensor[(16, 49, 192), float32] */;
    %371 = add(%370, %p1115) /* ty=Tensor[(16, 49, 192), float32] */;
    %372 = reshape(%371, newshape=[1, 4, 4, 7, 7, 192]) /* ty=Tensor[(1, 4, 4, 7, 7, 192), float32] */;
    %373 = transpose(%372, axes=[0, 1, 3, 2, 4, 5]) /* ty=Tensor[(1, 4, 7, 4, 7, 192), float32] */;
    %374 = reshape(%373, newshape=[1, 28, 28, -1]) /* ty=Tensor[(1, 28, 28, 192), float32] */;
    %375 = gather(%374, %p241, axis=1) /* ty=Tensor[(1, 28, 28, 192), float32] */;
    %376 = gather(%375, %p323, axis=2) /* ty=Tensor[(1, 28, 28, 192), float32] */;
    %377 = reshape(%376, newshape=[1, 784, 192]) /* ty=Tensor[(1, 784, 192), float32] */;
    add(%p423, %377) /* ty=Tensor[(1, 784, 192), float32] */
  };
  %742 = %741(%740, meta[relay.Constant][60] /* ty=Tensor[(192), float32] */, meta[relay.Constant][61] /* ty=Tensor[(1, 28, 28, 192), int64] */, meta[relay.Constant][62] /* ty=Tensor[(1, 28, 28, 192), int64] */, %707) /* ty=Tensor[(1, 784, 192), float32] */;
  %743 = fn (%p0246: Tensor[(1, 784, 192), float32], Primitive=1, hash="1d45326e7f287f68") -> Tensor[(1, 784, 1), float32] {
